window.LocDoc={
  "湖北省武汉": {
    "province": "湖北省",
    "city": "武汉市",
    "location": [
      114.305392,
      30.593098
    ]
  },
  "湖北省孝感": {
    "province": "湖北省",
    "city": "孝感市",
    "location": [
      113.916902,
      30.924568
    ]
  },
  "湖北省黄冈": {
    "province": "湖北省",
    "city": "黄冈市",
    "location": [
      114.872316,
      30.453905
    ]
  },
  "湖北省荆州": {
    "province": "湖北省",
    "city": "荆州市",
    "location": [
      112.239741,
      30.335165
    ]
  },
  "湖北省荆门": {
    "province": "湖北省",
    "city": "荆门市",
    "location": [
      112.199265,
      31.035423
    ]
  },
  "湖北省仙桃": {
    "province": "湖北省",
    "city": null,
    "location": [
      113.442973,
      30.328407
    ]
  },
  "湖北省宜昌": {
    "province": "湖北省",
    "city": "宜昌市",
    "location": [
      111.286471,
      30.691967
    ]
  },
  "湖北省十堰": {
    "province": "湖北省",
    "city": "十堰市",
    "location": [
      110.79799,
      32.629397
    ]
  },
  "广东省深圳": {
    "province": "广东省",
    "city": "深圳市",
    "location": [
      114.057868,
      22.543099
    ]
  },
  "广东省珠海": {
    "province": "广东省",
    "city": "珠海市",
    "location": [
      113.576726,
      22.270715
    ]
  },
  "广东省佛山": {
    "province": "广东省",
    "city": "佛山市",
    "location": [
      113.121416,
      23.021548
    ]
  },
  "广东省广州": {
    "province": "广东省",
    "city": "广州市",
    "location": [
      113.264434,
      23.129162
    ]
  },
  "广东省惠州": {
    "province": "广东省",
    "city": "惠州市",
    "location": [
      114.416196,
      23.111847
    ]
  },
  "广东省韶关": {
    "province": "广东省",
    "city": "韶关市",
    "location": [
      113.597522,
      24.810403
    ]
  },
  "广东省阳江": {
    "province": "广东省",
    "city": "阳江市",
    "location": [
      111.982232,
      21.857958
    ]
  },
  "广东省湛江": {
    "province": "广东省",
    "city": "湛江市",
    "location": [
      110.359377,
      21.270707
    ]
  },
  "广东省中山": {
    "province": "广东省",
    "city": "中山市",
    "location": [
      113.392782,
      22.517645
    ]
  },
  "广东省肇庆": {
    "province": "广东省",
    "city": "肇庆市",
    "location": [
      112.465091,
      23.047191
    ]
  },
  "广东省清远": {
    "province": "广东省",
    "city": "清远市",
    "location": [
      113.056031,
      23.681763
    ]
  },
  "浙江省台州": {
    "province": "浙江省",
    "city": "台州市",
    "location": [
      121.420757,
      28.656386
    ]
  },
  "浙江省杭州": {
    "province": "浙江省",
    "city": "杭州市",
    "location": [
      120.15507,
      30.274084
    ]
  },
  "浙江省温州": {
    "province": "浙江省",
    "city": "温州市",
    "location": [
      120.699366,
      27.994267
    ]
  },
  "浙江省宁波": {
    "province": "浙江省",
    "city": "宁波市",
    "location": [
      121.550357,
      29.874556
    ]
  },
  "浙江省嘉兴": {
    "province": "浙江省",
    "city": "嘉兴市",
    "location": [
      120.755486,
      30.746129
    ]
  },
  "浙江省衢州": {
    "province": "浙江省",
    "city": "衢州市",
    "location": [
      118.859457,
      28.970079
    ]
  },
  "浙江省舟山": {
    "province": "浙江省",
    "city": "舟山市",
    "location": [
      122.207215,
      29.985295
    ]
  },
  "浙江省绍兴": {
    "province": "浙江省",
    "city": "绍兴市",
    "location": [
      120.580232,
      30.029752
    ]
  },
  "浙江省金华": {
    "province": "浙江省",
    "city": "金华市",
    "location": [
      119.647444,
      29.079059
    ]
  },
  "北京市": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.407526,
      39.90403
    ]
  },
  "北京市外地来京人员": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.407526,
      39.90403
    ]
  },
  "北京市海淀": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.329519,
      39.972134
    ]
  },
  "北京市朝阳": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.601144,
      39.948574
    ]
  },
  "北京市西城": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.365868,
      39.912289
    ]
  },
  "北京市昌平": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.231204,
      40.22066
    ]
  },
  "北京市大兴": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.341014,
      39.784747
    ]
  },
  "北京市丰台": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.287149,
      39.858427
    ]
  },
  "北京市通州": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.656435,
      39.909946
    ]
  },
  "北京市石景山": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.222982,
      39.906611
    ]
  },
  "北京市顺义": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.654561,
      40.130347
    ]
  },
  "重庆市万州区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      108.408661,
      30.807667
    ]
  },
  "重庆市巫山县": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      109.879153,
      31.074834
    ]
  },
  "重庆市长寿区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      107.081283,
      29.857996
    ]
  },
  "重庆市垫江县": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      107.33339,
      30.327717
    ]
  },
  "重庆市永川区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      105.927376,
      29.356117
    ]
  },
  "重庆市九龙坡区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      106.53192,
      29.51419
    ]
  },
  "重庆市渝北区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      106.631187,
      29.718143
    ]
  },
  "重庆市开州区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      108.393143,
      31.1607
    ]
  },
  "重庆市涪陵区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      107.389298,
      29.703113
    ]
  },
  "重庆市大渡口区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      106.482347,
      29.484527
    ]
  },
  "重庆市忠县": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      108.039002,
      30.29956
    ]
  },
  "重庆市云阳县": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      108.697324,
      30.930613
    ]
  },
  "重庆市奉节县": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      109.463987,
      31.018498
    ]
  },
  "重庆市巫溪县": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      109.570062,
      31.398604
    ]
  },
  "重庆市秀山县": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      109.007094,
      28.447997
    ]
  },
  "重庆市两江新区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      106.5626,
      29.6674
    ]
  },
  "湖南省长沙": {
    "province": "湖南省",
    "city": "长沙市",
    "location": [
      112.938814,
      28.228209
    ]
  },
  "湖南省永州": {
    "province": "湖南省",
    "city": "永州市",
    "location": [
      111.613445,
      26.420394
    ]
  },
  "湖南省怀化": {
    "province": "湖南省",
    "city": "怀化市",
    "location": [
      109.998488,
      27.554978
    ]
  },
  "湖南省岳阳": {
    "province": "湖南省",
    "city": "岳阳市",
    "location": [
      113.128958,
      29.357104
    ]
  },
  "湖南省娄底": {
    "province": "湖南省",
    "city": "娄底市",
    "location": [
      111.993497,
      27.700062
    ]
  },
  "湖南省郴州": {
    "province": "湖南省",
    "city": "郴州市",
    "location": [
      113.014717,
      25.770509
    ]
  },
  "湖南省株洲": {
    "province": "湖南省",
    "city": "株洲市",
    "location": [
      113.134002,
      27.82755
    ]
  },
  "湖南省湘潭": {
    "province": "湖南省",
    "city": "湘潭市",
    "location": [
      112.944049,
      27.829738
    ]
  },
  "广西壮族自治区北海": {
    "province": "广西壮族自治区",
    "city": "北海市",
    "location": [
      109.119927,
      21.481254
    ]
  },
  "广西壮族自治区桂林": {
    "province": "广西壮族自治区",
    "city": "桂林市",
    "location": [
      110.290194,
      25.273566
    ]
  },
  "广西壮族自治区柳州": {
    "province": "广西壮族自治区",
    "city": "柳州市",
    "location": [
      109.415953,
      24.325502
    ]
  },
  "广西壮族自治区河池": {
    "province": "广西壮族自治区",
    "city": "河池市",
    "location": [
      108.085261,
      24.692931
    ]
  },
  "广西壮族自治区防城港": {
    "province": "广西壮族自治区",
    "city": "防城港市",
    "location": [
      108.353846,
      21.68686
    ]
  },
  "广西壮族自治区梧州": {
    "province": "广西壮族自治区",
    "city": "梧州市",
    "location": [
      111.279115,
      23.476962
    ]
  },
  "广西壮族自治区百色": {
    "province": "广西壮族自治区",
    "city": "百色市",
    "location": [
      106.618201,
      23.902333
    ]
  },
  "广西壮族自治区玉林": {
    "province": "广西壮族自治区",
    "city": "玉林市",
    "location": [
      110.164756,
      22.636379
    ]
  },
  "上海市": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.473701,
      31.230416
    ]
  },
  "江西省南昌": {
    "province": "江西省",
    "city": "南昌市",
    "location": [
      115.858197,
      28.682892
    ]
  },
  "江西省抚州": {
    "province": "江西省",
    "city": "抚州市",
    "location": [
      116.358181,
      27.949217
    ]
  },
  "江西省萍乡": {
    "province": "江西省",
    "city": "萍乡市",
    "location": [
      113.854556,
      27.622768
    ]
  },
  "江西省九江": {
    "province": "江西省",
    "city": "九江市",
    "location": [
      116.00193,
      29.705077
    ]
  },
  "江西省新余": {
    "province": "江西省",
    "city": "新余市",
    "location": [
      114.917346,
      27.817808
    ]
  },
  "江西省吉安": {
    "province": "江西省",
    "city": "吉安市",
    "location": [
      114.992509,
      27.113443
    ]
  },
  "四川省成都": {
    "province": "四川省",
    "city": "成都市",
    "location": [
      104.066541,
      30.572269
    ]
  },
  "四川省广安": {
    "province": "四川省",
    "city": "广安市",
    "location": [
      106.633212,
      30.455961
    ]
  },
  "四川省绵阳": {
    "province": "四川省",
    "city": "绵阳市",
    "location": [
      104.679114,
      31.46745
    ]
  },
  "四川省达州": {
    "province": "四川省",
    "city": "达州市",
    "location": [
      107.468023,
      31.209571
    ]
  },
  "四川省德阳": {
    "province": "四川省",
    "city": "德阳市",
    "location": [
      104.397894,
      31.126855
    ]
  },
  "四川省遂宁": {
    "province": "四川省",
    "city": "遂宁市",
    "location": [
      105.592898,
      30.532847
    ]
  },
  "四川省雅安": {
    "province": "四川省",
    "city": "雅安市",
    "location": [
      103.013261,
      29.980537
    ]
  },
  "山东省青岛": {
    "province": "山东省",
    "city": "青岛市",
    "location": [
      120.382639,
      36.067082
    ]
  },
  "山东省威海": {
    "province": "山东省",
    "city": "威海市",
    "location": [
      122.120419,
      37.513068
    ]
  },
  "山东省临沂": {
    "province": "山东省",
    "city": "临沂市",
    "location": [
      118.356448,
      35.104672
    ]
  },
  "山东省济南": {
    "province": "山东省",
    "city": "济南市",
    "location": [
      117.119999,
      36.651216
    ]
  },
  "山东省烟台": {
    "province": "山东省",
    "city": "烟台市",
    "location": [
      121.447935,
      37.463822
    ]
  },
  "山东省潍坊": {
    "province": "山东省",
    "city": "潍坊市",
    "location": [
      119.161755,
      36.706774
    ]
  },
  "山东省日照": {
    "province": "山东省",
    "city": "日照市",
    "location": [
      119.526888,
      35.416377
    ]
  },
  "山东省济宁": {
    "province": "山东省",
    "city": "济宁市",
    "location": [
      116.587098,
      35.414921
    ]
  },
  "安徽省合肥": {
    "province": "安徽省",
    "city": "合肥市",
    "location": [
      117.227239,
      31.820586
    ]
  },
  "安徽省六安": {
    "province": "安徽省",
    "city": "六安市",
    "location": [
      116.521854,
      31.733699
    ]
  },
  "安徽省阜阳": {
    "province": "安徽省",
    "city": "阜阳市",
    "location": [
      115.814204,
      32.890124
    ]
  },
  "安徽省滁州": {
    "province": "安徽省",
    "city": "滁州市",
    "location": [
      118.317106,
      32.301556
    ]
  },
  "安徽省亳州": {
    "province": "安徽省",
    "city": "亳州市",
    "location": [
      115.778676,
      33.844582
    ]
  },
  "安徽省安庆": {
    "province": "安徽省",
    "city": "安庆市",
    "location": [
      117.063754,
      30.543494
    ]
  },
  "安徽省池州": {
    "province": "安徽省",
    "city": "池州市",
    "location": [
      117.491568,
      30.6648
    ]
  },
  "安徽省蚌埠": {
    "province": "安徽省",
    "city": "蚌埠市",
    "location": [
      117.389719,
      32.916287
    ]
  },
  "福建省福州": {
    "province": "福建省",
    "city": "福州市",
    "location": [
      119.296494,
      26.074507
    ]
  },
  "福建省厦门": {
    "province": "福建省",
    "city": "厦门市",
    "location": [
      118.089425,
      24.479833
    ]
  },
  "福建省泉州": {
    "province": "福建省",
    "city": "泉州市",
    "location": [
      118.675675,
      24.874132
    ]
  },
  "福建省宁德": {
    "province": "福建省",
    "city": "宁德市",
    "location": [
      119.547932,
      26.665617
    ]
  },
  "河南省郑州": {
    "province": "河南省",
    "city": "郑州市",
    "location": [
      113.625368,
      34.746599
    ]
  },
  "河南省巩义": {
    "province": "河南省",
    "city": "郑州市",
    "location": [
      113.022497,
      34.747834
    ]
  },
  "河南省洛阳": {
    "province": "河南省",
    "city": "洛阳市",
    "location": [
      112.45404,
      34.619682
    ]
  },
  "河南省三门峡": {
    "province": "河南省",
    "city": "三门峡市",
    "location": [
      111.200135,
      34.772493
    ]
  },
  "河南省信阳": {
    "province": "河南省",
    "city": "信阳市",
    "location": [
      114.091023,
      32.146983
    ]
  },
  "河南省周口": {
    "province": "河南省",
    "city": "周口市",
    "location": [
      114.696951,
      33.626149
    ]
  },
  "江苏省南京": {
    "province": "江苏省",
    "city": "南京市",
    "location": [
      118.796877,
      32.060255
    ]
  },
  "江苏省苏州": {
    "province": "江苏省",
    "city": "苏州市",
    "location": [
      120.585315,
      31.298886
    ]
  },
  "江苏省连云港": {
    "province": "江苏省",
    "city": "连云港市",
    "location": [
      119.221611,
      34.596653
    ]
  },
  "江苏省扬州": {
    "province": "江苏省",
    "city": "扬州市",
    "location": [
      119.412966,
      32.39421
    ]
  },
  "江苏省南通": {
    "province": "江苏省",
    "city": "南通市",
    "location": [
      120.894291,
      31.980171
    ]
  },
  "江苏省无锡": {
    "province": "江苏省",
    "city": "无锡市",
    "location": [
      120.31191,
      31.491169
    ]
  },
  "海南省海口": {
    "province": "海南省",
    "city": "海口市",
    "location": [
      110.198293,
      20.044001
    ]
  },
  "海南省三亚": {
    "province": "海南省",
    "city": "三亚市",
    "location": [
      109.511909,
      18.252847
    ]
  },
  "海南省万宁": {
    "province": "海南省",
    "city": null,
    "location": [
      110.391073,
      18.795143
    ]
  },
  "海南省临高县": {
    "province": "海南省",
    "city": null,
    "location": [
      109.690508,
      19.912026
    ]
  },
  "天津市": {
    "province": "天津市",
    "city": "天津市",
    "location": [
      117.200983,
      39.084158
    ]
  },
  "云南省昆明": {
    "province": "云南省",
    "city": "昆明市",
    "location": [
      102.832891,
      24.880095
    ]
  },
  "云南省西双版纳州": {
    "province": "云南省",
    "city": "西双版纳傣族自治州",
    "location": [
      100.797777,
      22.007351
    ]
  },
  "云南省丽江市": {
    "province": "云南省",
    "city": "丽江市",
    "location": [
      100.22775,
      26.855047
    ]
  },
  "陕西省西安": {
    "province": "陕西省",
    "city": "西安市",
    "location": [
      108.940174,
      34.341568
    ]
  },
  "陕西省咸阳": {
    "province": "陕西省",
    "city": "咸阳市",
    "location": [
      108.708991,
      34.329605
    ]
  },
  "陕西省安康": {
    "province": "陕西省",
    "city": "安康市",
    "location": [
      109.029022,
      32.684714
    ]
  },
  "陕西省延安": {
    "province": "陕西省",
    "city": "延安市",
    "location": [
      109.489727,
      36.585455
    ]
  },
  "黑龙江省牡丹江": {
    "province": "黑龙江省",
    "city": "牡丹江市",
    "location": [
      129.633168,
      44.551653
    ]
  },
  "黑龙江省哈尔滨": {
    "province": "黑龙江省",
    "city": "哈尔滨市",
    "location": [
      126.534967,
      45.803775
    ]
  },
  "黑龙江省大庆": {
    "province": "黑龙江省",
    "city": "大庆市",
    "location": [
      125.103784,
      46.589309
    ]
  },
  "黑龙江省绥化": {
    "province": "黑龙江省",
    "city": "绥化市",
    "location": [
      126.968887,
      46.653845
    ]
  },
  "辽宁省沈阳": {
    "province": "辽宁省",
    "city": "沈阳市",
    "location": [
      123.431474,
      41.805698
    ]
  },
  "辽宁省大连": {
    "province": "辽宁省",
    "city": "大连市",
    "location": [
      121.614682,
      38.914003
    ]
  },
  "辽宁省朝阳": {
    "province": "辽宁省",
    "city": "朝阳市",
    "location": [
      120.389862,
      41.497767
    ]
  },
  "贵州省贵阳": {
    "province": "贵州省",
    "city": "贵阳市",
    "location": [
      106.630153,
      26.647661
    ]
  },
  "贵州省铜仁": {
    "province": "贵州省",
    "city": "铜仁市",
    "location": [
      109.189598,
      27.731514
    ]
  },
  "贵州省黔南州": {
    "province": "贵州省",
    "city": "黔南布依族苗族自治州",
    "location": [
      107.522097,
      26.254092
    ]
  },
  "吉林省长春": {
    "province": "吉林省",
    "city": "长春市",
    "location": [
      125.323544,
      43.817071
    ]
  },
  "吉林省吉林": {
    "province": "吉林省",
    "city": "吉林市",
    "location": [
      126.549576,
      43.837883
    ]
  },
  "吉林省松原": {
    "province": "吉林省",
    "city": "松原市",
    "location": [
      124.825117,
      45.141789
    ]
  },
  "台湾": {
    "province": "台湾省",
    "city": null,
    "location": [
      121.508903,
      25.044319
    ]
  },
  "宁夏回族自治区银川": {
    "province": "宁夏回族自治区",
    "city": "银川市",
    "location": [
      106.230909,
      38.487193
    ]
  },
  "宁夏回族自治区中卫": {
    "province": "宁夏回族自治区",
    "city": "中卫市",
    "location": [
      105.196902,
      37.499972
    ]
  },
  "香港": {
    "province": "香港特别行政区",
    "city": null,
    "location": [
      114.163825,
      22.276284
    ]
  },
  "澳门": {
    "province": "澳门特别行政区",
    "city": null,
    "location": [
      113.543028,
      22.186835
    ]
  },
  "河北省石家庄": {
    "province": "河北省",
    "city": "石家庄市",
    "location": [
      114.514859,
      38.042306
    ]
  },
  "河北省沧州": {
    "province": "河北省",
    "city": "沧州市",
    "location": [
      116.838834,
      38.304477
    ]
  },
  "甘肃省兰州": {
    "province": "甘肃省",
    "city": "兰州市",
    "location": [
      103.834303,
      36.061089
    ]
  },
  "甘肃省白银": {
    "province": "甘肃省",
    "city": "白银市",
    "location": [
      104.138559,
      36.544756
    ]
  },
  "新疆维吾尔自治区": {
    "province": "新疆维吾尔自治区",
    "city": null,
    "location": [
      87.627704,
      43.793026
    ]
  },
  "山西省太原": {
    "province": "山西省",
    "city": "太原市",
    "location": [
      112.548879,
      37.87059
    ]
  },
  "内蒙古自治区满洲里": {
    "province": "内蒙古自治区",
    "city": "呼伦贝尔市",
    "location": [
      117.37853,
      49.597841
    ]
  },
  "青海省": {
    "province": "青海省",
    "city": null,
    "location": [
      101.780199,
      36.620901
    ]
  },
  "湖北省咸宁": {
    "province": "湖北省",
    "city": "咸宁市",
    "location": [
      114.322492,
      29.841443
    ]
  },
  "湖北省随州": {
    "province": "湖北省",
    "city": "随州市",
    "location": [
      113.382458,
      31.690215
    ]
  },
  "湖北省黄石": {
    "province": "湖北省",
    "city": "黄石市",
    "location": [
      115.03852,
      30.199652
    ]
  },
  "湖北省恩施州": {
    "province": "湖北省",
    "city": "恩施土家族苗族自治州",
    "location": [
      109.488172,
      30.272156
    ]
  },
  "湖北省襄阳": {
    "province": "湖北省",
    "city": "襄阳市",
    "location": [
      112.122414,
      32.008986
    ]
  },
  "湖北省天门": {
    "province": "湖北省",
    "city": null,
    "location": [
      113.166558,
      30.66372
    ]
  },
  "湖北省鄂州": {
    "province": "湖北省",
    "city": "鄂州市",
    "location": [
      114.894843,
      30.39194
    ]
  },
  "广东省揭阳": {
    "province": "广东省",
    "city": "揭阳市",
    "location": [
      116.372831,
      23.549993
    ]
  },
  "广东省东莞": {
    "province": "广东省",
    "city": "东莞市",
    "location": [
      113.751765,
      23.020536
    ]
  },
  "广东省汕头": {
    "province": "广东省",
    "city": "汕头市",
    "location": [
      116.681972,
      23.354091
    ]
  },
  "广东省梅州": {
    "province": "广东省",
    "city": "梅州市",
    "location": [
      116.122238,
      24.288615
    ]
  },
  "浙江省丽水": {
    "province": "浙江省",
    "city": "丽水市",
    "location": [
      119.922796,
      28.46763
    ]
  },
  "浙江省湖州": {
    "province": "浙江省",
    "city": "湖州市",
    "location": [
      120.086823,
      30.894348
    ]
  },
  "河南省南阳": {
    "province": "河南省",
    "city": "南阳市",
    "location": [
      112.528321,
      32.990833
    ]
  },
  "河南省驻马店": {
    "province": "河南省",
    "city": "驻马店市",
    "location": [
      114.022298,
      33.011529
    ]
  },
  "河南省新乡": {
    "province": "河南省",
    "city": "新乡市",
    "location": [
      113.9268,
      35.303004
    ]
  },
  "河南省安阳市": {
    "province": "河南省",
    "city": "安阳市",
    "location": [
      114.392392,
      36.097577
    ]
  },
  "河南省漯河市": {
    "province": "河南省",
    "city": "漯河市",
    "location": [
      114.016539,
      33.581412
    ]
  },
  "河南省平顶山": {
    "province": "河南省",
    "city": "平顶山市",
    "location": [
      113.192661,
      33.766169
    ]
  },
  "重庆市石柱县": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      108.114069,
      29.999285
    ]
  },
  "重庆市江北区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      106.574271,
      29.606703
    ]
  },
  "重庆市合川区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      106.27613,
      29.972084
    ]
  },
  "重庆市璧山区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      106.227305,
      29.592024
    ]
  },
  "重庆市铜梁区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      106.056404,
      29.844811
    ]
  },
  "重庆市大足区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      105.721733,
      29.707032
    ]
  },
  "重庆市梁平区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      107.769568,
      30.654233
    ]
  },
  "重庆市城口县": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      108.664214,
      31.947633
    ]
  },
  "重庆市丰都县": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      107.730895,
      29.8635
    ]
  },
  "湖南省常德": {
    "province": "湖南省",
    "city": "常德市",
    "location": [
      111.698497,
      29.031673
    ]
  },
  "湖南省益阳": {
    "province": "湖南省",
    "city": "益阳市",
    "location": [
      112.35518,
      28.55386
    ]
  },
  "湖南省衡阳": {
    "province": "湖南省",
    "city": "衡阳市",
    "location": [
      112.571997,
      26.89323
    ]
  },
  "湖南省湘西自治州": {
    "province": "湖南省",
    "city": "湘西土家族苗族自治州",
    "location": [
      109.739172,
      28.311947
    ]
  },
  "湖南省邵阳": {
    "province": "湖南省",
    "city": "邵阳市",
    "location": [
      111.467791,
      27.238892
    ]
  },
  "北京市东城": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.416357,
      39.928353
    ]
  },
  "安徽省马鞍山": {
    "province": "安徽省",
    "city": "马鞍山市",
    "location": [
      118.506759,
      31.670452
    ]
  },
  "安徽省铜陵": {
    "province": "安徽省",
    "city": "铜陵市",
    "location": [
      117.812079,
      30.945429
    ]
  },
  "安徽省芜湖": {
    "province": "安徽省",
    "city": "芜湖市",
    "location": [
      118.432941,
      31.352859
    ]
  },
  "安徽省宿州": {
    "province": "安徽省",
    "city": "宿州市",
    "location": [
      116.964356,
      33.646373
    ]
  },
  "安徽省宣城": {
    "province": "安徽省",
    "city": "宣城市",
    "location": [
      118.758816,
      30.940718
    ]
  },
  "安徽省淮北": {
    "province": "安徽省",
    "city": "淮北市",
    "location": [
      116.798265,
      33.955844
    ]
  },
  "安徽省淮南": {
    "province": "安徽省",
    "city": "淮南市",
    "location": [
      116.999932,
      32.625478
    ]
  },
  "安徽省黄山": {
    "province": "安徽省",
    "city": "黄山市",
    "location": [
      118.337481,
      29.714655
    ]
  },
  "山东省德州": {
    "province": "山东省",
    "city": "德州市",
    "location": [
      116.357464,
      37.434092
    ]
  },
  "山东省滨州": {
    "province": "山东省",
    "city": "滨州市",
    "location": [
      117.970703,
      37.38199
    ]
  },
  "山东省聊城": {
    "province": "山东省",
    "city": "聊城市",
    "location": [
      115.985371,
      36.456703
    ]
  },
  "山东省菏泽": {
    "province": "山东省",
    "city": "菏泽市",
    "location": [
      115.480656,
      35.23375
    ]
  },
  "山东省淄博市": {
    "province": "山东省",
    "city": "淄博市",
    "location": [
      118.054927,
      36.813487
    ]
  },
  "四川省泸州": {
    "province": "四川省",
    "city": "泸州市",
    "location": [
      105.442258,
      28.87181
    ]
  },
  "四川省南充": {
    "province": "四川省",
    "city": "南充市",
    "location": [
      106.110698,
      30.837793
    ]
  },
  "四川省甘孜州": {
    "province": "四川省",
    "city": "甘孜藏族自治州",
    "location": [
      101.96231,
      30.04952
    ]
  },
  "四川省自贡": {
    "province": "四川省",
    "city": "自贡市",
    "location": [
      104.778442,
      29.33903
    ]
  },
  "四川省内江": {
    "province": "四川省",
    "city": "内江市",
    "location": [
      105.058433,
      29.580228
    ]
  },
  "四川省乐山": {
    "province": "四川省",
    "city": "乐山市",
    "location": [
      103.765568,
      29.552106
    ]
  },
  "四川省眉山": {
    "province": "四川省",
    "city": "眉山市",
    "location": [
      103.848538,
      30.075439
    ]
  },
  "广西壮族自治区南宁": {
    "province": "广西壮族自治区",
    "city": "南宁市",
    "location": [
      108.366543,
      22.817002
    ]
  },
  "江西省赣州": {
    "province": "江西省",
    "city": "赣州市",
    "location": [
      114.935029,
      25.831829
    ]
  },
  "江西省上饶": {
    "province": "江西省",
    "city": "上饶市",
    "location": [
      117.943433,
      28.454862
    ]
  },
  "江西省宜春": {
    "province": "江西省",
    "city": "宜春市",
    "location": [
      114.416778,
      27.815619
    ]
  },
  "江西省景德镇": {
    "province": "江西省",
    "city": "景德镇市",
    "location": [
      117.178419,
      29.268835
    ]
  },
  "福建省漳州": {
    "province": "福建省",
    "city": "漳州市",
    "location": [
      117.647481,
      24.512948
    ]
  },
  "福建省三明": {
    "province": "福建省",
    "city": "三明市",
    "location": [
      117.638678,
      26.263406
    ]
  },
  "福建省莆田": {
    "province": "福建省",
    "city": "莆田市",
    "location": [
      119.007777,
      25.454084
    ]
  },
  "福建省南平": {
    "province": "福建省",
    "city": "南平市",
    "location": [
      118.177708,
      26.641768
    ]
  },
  "江苏省常州": {
    "province": "江苏省",
    "city": "常州市",
    "location": [
      119.973987,
      31.810689
    ]
  },
  "江苏省镇江": {
    "province": "江苏省",
    "city": "镇江市",
    "location": [
      119.425836,
      32.187849
    ]
  },
  "江苏省盐城": {
    "province": "江苏省",
    "city": "盐城市",
    "location": [
      120.163561,
      33.347382
    ]
  },
  "江苏省宿迁": {
    "province": "江苏省",
    "city": "宿迁市",
    "location": [
      118.275198,
      33.963232
    ]
  },
  "江苏省淮安": {
    "province": "江苏省",
    "city": "淮安市",
    "location": [
      119.015285,
      33.610353
    ]
  },
  "江苏省泰州": {
    "province": "江苏省",
    "city": "泰州市",
    "location": [
      119.923116,
      32.455778
    ]
  },
  "海南省儋州": {
    "province": "海南省",
    "city": null,
    "location": [
      110.349228,
      20.017377
    ]
  },
  "海南省陵水县": {
    "province": "海南省",
    "city": null,
    "location": [
      110.037504,
      18.506048
    ]
  },
  "海南省澄迈县": {
    "province": "海南省",
    "city": null,
    "location": [
      110.006755,
      19.738521
    ]
  },
  "辽宁省铁岭": {
    "province": "辽宁省",
    "city": "铁岭市",
    "location": [
      123.726166,
      42.223769
    ]
  },
  "辽宁省葫芦岛": {
    "province": "辽宁省",
    "city": "葫芦岛市",
    "location": [
      120.836932,
      40.711052
    ]
  },
  "辽宁省本溪": {
    "province": "辽宁省",
    "city": "本溪市",
    "location": [
      123.766485,
      41.294175
    ]
  },
  "辽宁省盘锦": {
    "province": "辽宁省",
    "city": "盘锦市",
    "location": [
      122.070714,
      41.119997
    ]
  },
  "辽宁省营口": {
    "province": "辽宁省",
    "city": "营口市",
    "location": [
      122.235417,
      40.667012
    ]
  },
  "辽宁省丹东": {
    "province": "辽宁省",
    "city": "丹东市",
    "location": [
      124.354706,
      40.000499
    ]
  },
  "陕西省铜川": {
    "province": "陕西省",
    "city": "铜川市",
    "location": [
      108.945233,
      34.896756
    ]
  },
  "陕西省商洛": {
    "province": "陕西省",
    "city": "商洛市",
    "location": [
      109.940477,
      33.870422
    ]
  },
  "陕西省汉中": {
    "province": "陕西省",
    "city": "汉中市",
    "location": [
      107.023323,
      33.06748
    ]
  },
  "云南省丽江": {
    "province": "云南省",
    "city": "丽江市",
    "location": [
      100.22775,
      26.855047
    ]
  },
  "云南省保山": {
    "province": "云南省",
    "city": "保山市",
    "location": [
      99.161761,
      25.112046
    ]
  },
  "云南省德宏": {
    "province": "云南省",
    "city": "德宏傣族景颇族自治州",
    "location": [
      98.584895,
      24.433353
    ]
  },
  "云南省西双版纳": {
    "province": "云南省",
    "city": "西双版纳傣族自治州",
    "location": [
      100.797777,
      22.007351
    ]
  },
  "云南省曲靖": {
    "province": "云南省",
    "city": "曲靖市",
    "location": [
      103.796167,
      25.489999
    ]
  },
  "云南省玉溪": {
    "province": "云南省",
    "city": "玉溪市",
    "location": [
      102.546543,
      24.352036
    ]
  },
  "云南省红河": {
    "province": "云南省",
    "city": "红河哈尼族彝族自治州",
    "location": [
      103.374799,
      23.36313
    ]
  },
  "云南省大理": {
    "province": "云南省",
    "city": "大理白族自治州",
    "location": [
      100.267638,
      25.606486
    ]
  },
  "云南省昭通": {
    "province": "云南省",
    "city": "昭通市",
    "location": [
      103.717465,
      27.338257
    ]
  },
  "黑龙江省齐齐哈尔": {
    "province": "黑龙江省",
    "city": "齐齐哈尔市",
    "location": [
      123.918186,
      47.354348
    ]
  },
  "黑龙江省佳木斯": {
    "province": "黑龙江省",
    "city": "佳木斯市",
    "location": [
      130.318917,
      46.799922
    ]
  },
  "天津市河北区": {
    "province": "天津市",
    "city": "天津市",
    "location": [
      117.196648,
      39.147869
    ]
  },
  "天津市河东区": {
    "province": "天津市",
    "city": "天津市",
    "location": [
      117.251587,
      39.128291
    ]
  },
  "天津市外地来津": {
    "province": "天津市",
    "city": "天津市",
    "location": [
      117.200983,
      39.084158
    ]
  },
  "天津市滨海新区": {
    "province": "天津市",
    "city": "天津市",
    "location": [
      117.78067,
      39.246083
    ]
  },
  "天津市和平区": {
    "province": "天津市",
    "city": "天津市",
    "location": [
      117.208125,
      39.118897
    ]
  },
  "天津市南开区": {
    "province": "天津市",
    "city": "天津市",
    "location": [
      117.150738,
      39.138203
    ]
  },
  "天津市西青区": {
    "province": "天津市",
    "city": "天津市",
    "location": [
      117.013949,
      39.141591
    ]
  },
  "河北省保定": {
    "province": "河北省",
    "city": "保定市",
    "location": [
      115.464806,
      38.873891
    ]
  },
  "河北省邯郸市": {
    "province": "河北省",
    "city": "邯郸市",
    "location": [
      114.538961,
      36.625657
    ]
  },
  "河北省承德": {
    "province": "河北省",
    "city": "承德市",
    "location": [
      117.96241,
      40.954071
    ]
  },
  "山西省晋中": {
    "province": "山西省",
    "city": "晋中市",
    "location": [
      112.752694,
      37.687024
    ]
  },
  "山西省运城": {
    "province": "山西省",
    "city": "运城市",
    "location": [
      111.007528,
      35.026412
    ]
  },
  "山西省阳泉": {
    "province": "山西省",
    "city": "阳泉市",
    "location": [
      113.580519,
      37.856971
    ]
  },
  "山西省大同": {
    "province": "山西省",
    "city": "大同市",
    "location": [
      113.61244,
      40.040295
    ]
  },
  "山西省长治": {
    "province": "山西省",
    "city": "长治市",
    "location": [
      113.116255,
      36.195386
    ]
  },
  "内蒙古自治区锡林郭勒盟": {
    "province": "内蒙古自治区",
    "city": "锡林郭勒盟",
    "location": [
      116.048222,
      43.933454
    ]
  },
  "内蒙古自治区鄂尔多斯": {
    "province": "内蒙古自治区",
    "city": "鄂尔多斯市",
    "location": [
      109.781327,
      39.608266
    ]
  },
  "内蒙古自治区赤峰": {
    "province": "内蒙古自治区",
    "city": "赤峰市",
    "location": [
      118.886856,
      42.257817
    ]
  },
  "内蒙古自治区呼伦贝尔牙克石市": {
    "province": "内蒙古自治区",
    "city": "呼伦贝尔市",
    "location": [
      120.735775,
      49.293222
    ]
  },
  "甘肃省白银市": {
    "province": "甘肃省",
    "city": "白银市",
    "location": [
      104.138559,
      36.544756
    ]
  },
  "甘肃省临夏": {
    "province": "甘肃省",
    "city": "临夏回族自治州",
    "location": [
      103.210538,
      35.601182
    ]
  },
  "甘肃省定西": {
    "province": "甘肃省",
    "city": "定西市",
    "location": [
      104.626282,
      35.580662
    ]
  },
  "贵州省黔西南州": {
    "province": "贵州省",
    "city": "黔西南布依族苗族自治州",
    "location": [
      104.906396,
      25.087825
    ]
  },
  "宁夏回族自治区固原": {
    "province": "宁夏回族自治区",
    "city": "固原市",
    "location": [
      106.24261,
      36.015855
    ]
  },
  "新疆维吾尔自治区乌鲁木齐": {
    "province": "新疆维吾尔自治区",
    "city": "乌鲁木齐市",
    "location": [
      87.616848,
      43.825592
    ]
  },
  "新疆维吾尔自治区伊犁州": {
    "province": "新疆维吾尔自治区",
    "city": "伊犁哈萨克自治州",
    "location": [
      81.324136,
      43.916823
    ]
  },
  "青海省西宁": {
    "province": "青海省",
    "city": "西宁市",
    "location": [
      101.778228,
      36.617144
    ]
  },
  "湖北省潜江": {
    "province": "湖北省",
    "city": null,
    "location": [
      112.900287,
      30.401947
    ]
  },
  "广东省汕尾": {
    "province": "广东省",
    "city": "汕尾市",
    "location": [
      115.375278,
      22.786211
    ]
  },
  "河南省漯河": {
    "province": "河南省",
    "city": "漯河市",
    "location": [
      114.016539,
      33.581412
    ]
  },
  "河南省商丘": {
    "province": "河南省",
    "city": "商丘市",
    "location": [
      115.65637,
      34.414172
    ]
  },
  "河南省鹤壁": {
    "province": "河南省",
    "city": "鹤壁市",
    "location": [
      114.297272,
      35.747225
    ]
  },
  "河南省开封": {
    "province": "河南省",
    "city": "开封市",
    "location": [
      114.307581,
      34.797239
    ]
  },
  "河南省许昌": {
    "province": "河南省",
    "city": "许昌市",
    "location": [
      113.85264,
      34.035506
    ]
  },
  "重庆市江津区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      106.259281,
      29.290069
    ]
  },
  "重庆市潼南区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      105.840556,
      30.191013
    ]
  },
  "重庆市巴南区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      106.53384,
      29.375528
    ]
  },
  "重庆市綦江区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      106.651362,
      29.028067
    ]
  },
  "山东省淄博": {
    "province": "山东省",
    "city": "淄博市",
    "location": [
      118.054927,
      36.813487
    ]
  },
  "山东省枣庄": {
    "province": "山东省",
    "city": "枣庄市",
    "location": [
      117.323725,
      34.810487
    ]
  },
  "四川省资阳": {
    "province": "四川省",
    "city": "资阳市",
    "location": [
      104.627636,
      30.128901
    ]
  },
  "四川省宜宾": {
    "province": "四川省",
    "city": "宜宾市",
    "location": [
      104.643215,
      28.751768
    ]
  },
  "四川省凉山州": {
    "province": "四川省",
    "city": "凉山彝族自治州",
    "location": [
      102.267335,
      27.88161
    ]
  },
  "上海市外地来沪人员": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.473701,
      31.230416
    ]
  },
  "上海市浦东新区": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.544379,
      31.221517
    ]
  },
  "上海市长宁区": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.424624,
      31.220367
    ]
  },
  "上海市静安区": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.459384,
      31.247105
    ]
  },
  "上海市徐汇区": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.437866,
      31.19919
    ]
  },
  "上海市虹口区": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.505133,
      31.2646
    ]
  },
  "上海市闵行区": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.381709,
      31.112813
    ]
  },
  "上海市青浦区": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.124178,
      31.150681
    ]
  },
  "上海市黄浦区": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.46924,
      31.22986
    ]
  },
  "上海市宝山区": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.489612,
      31.405457
    ]
  },
  "上海市嘉定区": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.2653,
      31.375602
    ]
  },
  "上海市奉贤区": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.474042,
      30.917795
    ]
  },
  "江苏省徐州": {
    "province": "江苏省",
    "city": "徐州市",
    "location": [
      117.284124,
      34.205768
    ]
  },
  "陕西省渭南": {
    "province": "陕西省",
    "city": "渭南市",
    "location": [
      109.509786,
      34.499995
    ]
  },
  "天津市河西区": {
    "province": "天津市",
    "city": "天津市",
    "location": [
      117.223372,
      39.109563
    ]
  },
  "天津市红桥区": {
    "province": "天津市",
    "city": "天津市",
    "location": [
      117.151533,
      39.167345
    ]
  },
  "黑龙江省双鸭山": {
    "province": "黑龙江省",
    "city": "双鸭山市",
    "location": [
      131.159133,
      46.646508
    ]
  },
  "黑龙江省七台河": {
    "province": "黑龙江省",
    "city": "七台河市",
    "location": [
      131.003138,
      45.771726
    ]
  },
  "河北省廊坊": {
    "province": "河北省",
    "city": "廊坊市",
    "location": [
      116.683752,
      39.538047
    ]
  },
  "河北省邢台": {
    "province": "河北省",
    "city": "邢台市",
    "location": [
      114.504844,
      37.070589
    ]
  },
  "甘肃省张掖": {
    "province": "甘肃省",
    "city": "张掖市",
    "location": [
      100.449818,
      38.925875
    ]
  },
  "甘肃省陇南": {
    "province": "甘肃省",
    "city": "陇南市",
    "location": [
      104.921841,
      33.400684
    ]
  },
  "山西省朔州": {
    "province": "山西省",
    "city": "朔州市",
    "location": [
      112.432825,
      39.331595
    ]
  },
  "山西省临汾": {
    "province": "山西省",
    "city": "临汾市",
    "location": [
      111.518976,
      36.088005
    ]
  },
  "山西省吕梁": {
    "province": "山西省",
    "city": "吕梁市",
    "location": [
      111.144319,
      37.518314
    ]
  },
  "内蒙古自治区包头市东河区": {
    "province": "内蒙古自治区",
    "city": "包头市",
    "location": [
      110.044142,
      40.575948
    ]
  },
  "内蒙古自治区锡林郭勒盟锡林浩特": {
    "province": "内蒙古自治区",
    "city": "锡林郭勒盟",
    "location": [
      116.086032,
      43.933411
    ]
  },
  "内蒙古自治区鄂尔多斯东胜区": {
    "province": "内蒙古自治区",
    "city": "鄂尔多斯市",
    "location": [
      109.963339,
      39.822507
    ]
  },
  "内蒙古自治区赤峰市松山区": {
    "province": "内蒙古自治区",
    "city": "赤峰市",
    "location": [
      118.933235,
      42.284008
    ]
  },
  "内蒙古自治区呼伦贝尔满洲里": {
    "province": "内蒙古自治区",
    "city": "呼伦贝尔市",
    "location": [
      117.37853,
      49.597841
    ]
  },
  "内蒙古自治区兴安盟乌兰浩特": {
    "province": "内蒙古自治区",
    "city": "兴安盟",
    "location": [
      122.093123,
      46.072732
    ]
  },
  "内蒙古自治区通辽市经济开发区": {
    "province": "内蒙古自治区",
    "city": "通辽市",
    "location": [
      122.213697,
      43.671519
    ]
  },
  "内蒙古自治区锡林郭勒盟二连浩特": {
    "province": "内蒙古自治区",
    "city": "锡林郭勒盟",
    "location": [
      111.977943,
      43.65317
    ]
  },
  "内蒙古自治区鄂尔多斯鄂托克前旗": {
    "province": "内蒙古自治区",
    "city": "鄂尔多斯市",
    "location": [
      107.477515,
      38.182362
    ]
  },
  "内蒙古自治区呼伦贝尔牙克石": {
    "province": "内蒙古自治区",
    "city": "呼伦贝尔市",
    "location": [
      120.735775,
      49.293222
    ]
  },
  "贵州省六盘水": {
    "province": "贵州省",
    "city": "六盘水市",
    "location": [
      104.830359,
      26.592666
    ]
  },
  "吉林省四平": {
    "province": "吉林省",
    "city": "四平市",
    "location": [
      124.350398,
      43.166419
    ]
  },
  "湖北省神农架林区": {
    "province": "湖北省",
    "city": null,
    "location": [
      110.675757,
      31.744897
    ]
  },
  "河南省安阳": {
    "province": "河南省",
    "city": "安阳市",
    "location": [
      114.392392,
      36.097577
    ]
  },
  "河南省焦作": {
    "province": "河南省",
    "city": "焦作市",
    "location": [
      113.241823,
      35.215892
    ]
  },
  "重庆市黔江区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      108.770678,
      29.53361
    ]
  },
  "重庆市南岸区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      106.644428,
      29.500297
    ]
  },
  "四川省凉山": {
    "province": "四川省",
    "city": "凉山彝族自治州",
    "location": [
      102.267335,
      27.88161
    ]
  },
  "山东省泰安": {
    "province": "山东省",
    "city": "泰安市",
    "location": [
      117.087614,
      36.200252
    ]
  },
  "福建省龙岩": {
    "province": "福建省",
    "city": "龙岩市",
    "location": [
      117.017536,
      25.075123
    ]
  },
  "江西省鹰潭": {
    "province": "江西省",
    "city": "鹰潭市",
    "location": [
      117.069202,
      28.260189
    ]
  },
  "上海市浦东": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.544379,
      31.221517
    ]
  },
  "上海市长宁": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.424624,
      31.220367
    ]
  },
  "上海市静安": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.459384,
      31.247105
    ]
  },
  "上海市徐汇": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.437866,
      31.19919
    ]
  },
  "上海市虹口": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.505133,
      31.2646
    ]
  },
  "上海市闵行": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.381709,
      31.112813
    ]
  },
  "上海市青浦": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.124178,
      31.150681
    ]
  },
  "上海市黄浦": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.46924,
      31.22986
    ]
  },
  "上海市宝山": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.489612,
      31.405457
    ]
  },
  "上海市嘉定": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.2653,
      31.375602
    ]
  },
  "上海市奉贤": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.474042,
      30.917795
    ]
  },
  "海南省琼海市": {
    "province": "海南省",
    "city": null,
    "location": [
      110.474581,
      19.25914
    ]
  },
  "海南省东方市": {
    "province": "海南省",
    "city": null,
    "location": [
      108.651815,
      19.095351
    ]
  },
  "海南省琼中县": {
    "province": "海南省",
    "city": null,
    "location": [
      109.838389,
      19.033369
    ]
  },
  "河北省邯郸": {
    "province": "河北省",
    "city": "邯郸市",
    "location": [
      114.538961,
      36.625657
    ]
  },
  "河北省衡水": {
    "province": "河北省",
    "city": "衡水市",
    "location": [
      115.670177,
      37.73892
    ]
  },
  "河北省唐山": {
    "province": "河北省",
    "city": "唐山市",
    "location": [
      118.180193,
      39.630867
    ]
  },
  "辽宁省辽阳": {
    "province": "辽宁省",
    "city": "辽阳市",
    "location": [
      123.236944,
      41.267244
    ]
  },
  "甘肃省金昌": {
    "province": "甘肃省",
    "city": "金昌市",
    "location": [
      102.188043,
      38.520089
    ]
  },
  "甘肃省天水": {
    "province": "甘肃省",
    "city": "天水市",
    "location": [
      105.724947,
      34.580863
    ]
  },
  "内蒙古自治区包头市昆都仑区": {
    "province": "内蒙古自治区",
    "city": "包头市",
    "location": [
      109.838178,
      40.642236
    ]
  },
  "内蒙古自治区赤峰市林西县": {
    "province": "内蒙古自治区",
    "city": "赤峰市",
    "location": [
      118.05545,
      43.61812
    ]
  },
  "宁夏回族自治区吴忠": {
    "province": "宁夏回族自治区",
    "city": "吴忠市",
    "location": [
      106.198393,
      37.99746
    ]
  },
  "新疆维吾尔自治区吐鲁番市": {
    "province": "新疆维吾尔自治区",
    "city": "吐鲁番市",
    "location": [
      89.189655,
      42.951384
    ]
  },
  "新疆维吾尔自治区第七师": {
    "province": "新疆维吾尔自治区",
    "city": null,
    "location": [
      87.627704,
      43.793026
    ]
  },
  "新疆维吾尔自治区第八师石河子市": {
    "province": "新疆维吾尔自治区",
    "city": null,
    "location": [
      86.041075,
      44.305886
    ]
  },
  "吉林省公主岭": {
    "province": "吉林省",
    "city": "四平市",
    "location": [
      124.82283,
      43.504687
    ]
  },
  "内蒙古自治区包头": {
    "province": "内蒙古自治区",
    "city": "包头市",
    "location": [
      109.840347,
      40.657449
    ]
  },
  "内蒙古自治区呼和浩特（新城区）": {
    "province": "内蒙古自治区",
    "city": "呼和浩特市",
    "location": [
      111.665544,
      40.858289
    ]
  },
  "内蒙古自治区通辽": {
    "province": "内蒙古自治区",
    "city": "通辽市",
    "location": [
      122.243444,
      43.65289
    ]
  },
  "陕西省宝鸡": {
    "province": "陕西省",
    "city": "宝鸡市",
    "location": [
      107.237974,
      34.361979
    ]
  },
  "内蒙古自治区呼和浩特": {
    "province": "内蒙古自治区",
    "city": "呼和浩特市",
    "location": [
      111.74918,
      40.842585
    ]
  },
  "内蒙古自治区呼伦贝尔": {
    "province": "内蒙古自治区",
    "city": "呼伦贝尔市",
    "location": [
      119.765744,
      49.211574
    ]
  },
  "内蒙古自治区兴安盟": {
    "province": "内蒙古自治区",
    "city": "兴安盟",
    "location": [
      122.067042,
      46.077561
    ]
  },
  "广东省河源": {
    "province": "广东省",
    "city": "河源市",
    "location": [
      114.700447,
      23.743538
    ]
  },
  "甘肃省未知": {
    "province": "甘肃省",
    "city": null,
    "location": [
      103.826308,
      36.059421
    ]
  },
  "河南省固始县": {
    "province": "河南省",
    "city": "信阳市",
    "location": [
      115.654482,
      32.168137
    ]
  },
  "内蒙古自治区锡林郭勒": {
    "province": "内蒙古自治区",
    "city": "锡林郭勒盟",
    "location": [
      116.048222,
      43.933454
    ]
  },
  "澳门澳门": {
    "province": "澳门特别行政区",
    "city": null,
    "location": [
      113.543028,
      22.186835
    ]
  },
  "甘肃省金昌市": {
    "province": "甘肃省",
    "city": "金昌市",
    "location": [
      102.188043,
      38.520089
    ]
  },
  "甘肃省天水市": {
    "province": "甘肃省",
    "city": "天水市",
    "location": [
      105.724947,
      34.580863
    ]
  },
  "辽宁省锦州": {
    "province": "辽宁省",
    "city": "锦州市",
    "location": [
      121.127003,
      41.095119
    ]
  },
  "山西省朔州市": {
    "province": "山西省",
    "city": "朔州市",
    "location": [
      112.432825,
      39.331595
    ]
  },
  "山西省临汾市": {
    "province": "山西省",
    "city": "临汾市",
    "location": [
      111.518976,
      36.088005
    ]
  },
  "河南省濮阳": {
    "province": "河南省",
    "city": "濮阳市",
    "location": [
      115.029215,
      35.761829
    ]
  },
  "河南省未知地区": {
    "province": "河南省",
    "city": null,
    "location": [
      113.753602,
      34.765515
    ]
  },
  "西藏自治区": {
    "province": "西藏自治区",
    "city": null,
    "location": [
      91.117212,
      29.646922
    ]
  },
  "安徽省宿松": {
    "province": "安徽省",
    "city": "安庆市",
    "location": [
      116.129105,
      30.153746
    ]
  },
  "广东省茂名": {
    "province": "广东省",
    "city": "茂名市",
    "location": [
      110.925456,
      21.662999
    ]
  },
  "重庆市渝中区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      106.568892,
      29.55275
    ]
  },
  "四川省巴中": {
    "province": "四川省",
    "city": "巴中市",
    "location": [
      106.747477,
      31.867903
    ]
  },
  "四川省广元": {
    "province": "四川省",
    "city": "广元市",
    "location": [
      105.843357,
      32.435435
    ]
  },
  "河北省张家口": {
    "province": "河北省",
    "city": "张家口市",
    "location": [
      114.887543,
      40.824418
    ]
  },
  "黑龙江省鸡西": {
    "province": "黑龙江省",
    "city": "鸡西市",
    "location": [
      130.969333,
      45.295075
    ]
  },
  "甘肃省平凉市": {
    "province": "甘肃省",
    "city": "平凉市",
    "location": [
      106.66524,
      35.543051
    ]
  },
  "吉林省四平市": {
    "province": "吉林省",
    "city": "四平市",
    "location": [
      124.350398,
      43.166419
    ]
  },
  "吉林省通化": {
    "province": "吉林省",
    "city": "通化市",
    "location": [
      125.939697,
      41.728401
    ]
  },
  "内蒙古自治区巴彦淖尔": {
    "province": "内蒙古自治区",
    "city": "巴彦淖尔市",
    "location": [
      107.387657,
      40.743213
    ]
  },
  "安徽省歙县": {
    "province": "安徽省",
    "city": "黄山市",
    "location": [
      118.415356,
      29.861308
    ]
  },
  "云南省普洱": {
    "province": "云南省",
    "city": "普洱市",
    "location": [
      100.966512,
      22.825065
    ]
  },
  "北京市门头沟": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.102009,
      39.940646
    ]
  },
  "黑龙江省大兴安岭": {
    "province": "黑龙江省",
    "city": "大兴安岭地区",
    "location": [
      124.71108,
      52.335206
    ]
  },
  "上海市松江": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.227747,
      31.032243
    ]
  },
  "上海市金山": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.34197,
      30.741991
    ]
  },
  "广东省江门": {
    "province": "广东省",
    "city": "江门市",
    "location": [
      113.081901,
      22.578738
    ]
  },
  "广东省外地来穗人员": {
    "province": "广东省",
    "city": null,
    "location": [
      113.26653,
      23.132191
    ]
  },
  "广东省外地来粤人员": {
    "province": "广东省",
    "city": null,
    "location": [
      113.26653,
      23.132191
    ]
  },
  "天津市外地来津人员": {
    "province": "天津市",
    "city": "天津市",
    "location": [
      117.200983,
      39.084158
    ]
  },
  "新疆维吾尔自治区吐鲁番": {
    "province": "新疆维吾尔自治区",
    "city": "吐鲁番市",
    "location": [
      89.189655,
      42.951384
    ]
  },
  "新疆维吾尔自治区第八师石河子": {
    "province": "新疆维吾尔自治区",
    "city": null,
    "location": [
      86.079895,
      44.458214
    ]
  },
  "湖北省未知地区": {
    "province": "湖北省",
    "city": null,
    "location": [
      114.305392,
      30.593098
    ]
  },
  "重庆市武隆区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      107.760025,
      29.325601
    ]
  },
  "广西壮族自治区钦州": {
    "province": "广西壮族自治区",
    "city": "钦州市",
    "location": [
      108.654146,
      21.979933
    ]
  },
  "广西壮族自治区贺州": {
    "province": "广西壮族自治区",
    "city": "贺州市",
    "location": [
      111.566694,
      24.403582
    ]
  },
  "河南省滑县": {
    "province": "河南省",
    "city": "安阳市",
    "location": [
      114.518997,
      35.575002
    ]
  },
  "河南省长垣县": {
    "province": "河南省",
    "city": "新乡市",
    "location": [
      114.668936,
      35.201548
    ]
  },
  "贵州省遵义": {
    "province": "贵州省",
    "city": "遵义市",
    "location": [
      106.927389,
      27.725654
    ]
  },
  "贵州省黔东南州": {
    "province": "贵州省",
    "city": "黔东南苗族侗族自治州",
    "location": [
      107.982859,
      26.583442
    ]
  },
  "贵州省毕节": {
    "province": "贵州省",
    "city": "毕节市",
    "location": [
      105.283992,
      27.302589
    ]
  },
  "黑龙江省鹤岗": {
    "province": "黑龙江省",
    "city": "鹤岗市",
    "location": [
      130.297964,
      47.349916
    ]
  },
  "吉林省延边": {
    "province": "吉林省",
    "city": "延边朝鲜族自治州",
    "location": [
      129.508946,
      42.891253
    ]
  },
  "湖南省张家界": {
    "province": "湖南省",
    "city": "张家界市",
    "location": [
      110.479191,
      29.117096
    ]
  },
  "陕西省榆林": {
    "province": "陕西省",
    "city": "榆林市",
    "location": [
      109.734589,
      38.28539
    ]
  },
  "陕西省韩城": {
    "province": "陕西省",
    "city": "渭南市",
    "location": [
      110.442847,
      35.476788
    ]
  },
  "宁夏回族自治区宁东": {
    "province": "宁夏回族自治区",
    "city": "银川市",
    "location": [
      106.58371,
      38.162289
    ]
  },
  "宁夏回族自治区宁东管委会": {
    "province": "宁夏回族自治区",
    "city": "银川市",
    "location": [
      106.576835,
      38.159388
    ]
  },
  "上海市杨浦": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.526077,
      31.259541
    ]
  },
  "内蒙古自治区乌兰察布": {
    "province": "内蒙古自治区",
    "city": "乌兰察布市",
    "location": [
      113.132585,
      40.994785
    ]
  },
  "北京市怀柔": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.642349,
      40.315704
    ]
  },
  "重庆市荣昌区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      105.594623,
      29.405002
    ]
  },
  "海南省定安": {
    "province": "海南省",
    "city": null,
    "location": [
      110.358891,
      19.681434
    ]
  },
  "海南省昌江": {
    "province": "海南省",
    "city": null,
    "location": [
      109.055724,
      19.298062
    ]
  },
  "甘肃省平凉": {
    "province": "甘肃省",
    "city": "平凉市",
    "location": [
      106.66524,
      35.543051
    ]
  },
  "四川省攀枝花": {
    "province": "四川省",
    "city": "攀枝花市",
    "location": [
      101.718637,
      26.582347
    ]
  },
  "四川省阿坝州": {
    "province": "四川省",
    "city": "阿坝藏族羌族自治州",
    "location": [
      102.224653,
      31.899413
    ]
  },
  "河南省永城": {
    "province": "河南省",
    "city": "商丘市",
    "location": [
      116.4495,
      33.929291
    ]
  },
  "新疆维吾尔自治区阿克苏": {
    "province": "新疆维吾尔自治区",
    "city": "阿克苏地区",
    "location": [
      80.260605,
      41.168779
    ]
  },
  "天津市宁河": {
    "province": "天津市",
    "city": "天津市",
    "location": [
      117.826625,
      39.329858
    ]
  },
  "天津市宁河区": {
    "province": "天津市",
    "city": "天津市",
    "location": [
      117.826625,
      39.329858
    ]
  },
  "海南省乐东": {
    "province": "海南省",
    "city": null,
    "location": [
      109.173055,
      18.75026
    ]
  },
  "河南省长垣": {
    "province": "河南省",
    "city": "新乡市",
    "location": [
      114.668936,
      35.201548
    ]
  },
  "重庆市云阳": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      108.697324,
      30.930613
    ]
  },
  "重庆市巫溪": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      109.570062,
      31.398604
    ]
  },
  "重庆市垫江": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      107.33339,
      30.327717
    ]
  },
  "重庆市石柱": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      108.114069,
      29.999285
    ]
  },
  "重庆市巫山": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      109.879153,
      31.074834
    ]
  },
  "重庆市奉节": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      109.463987,
      31.018498
    ]
  },
  "重庆市丰都": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      107.730895,
      29.8635
    ]
  },
  "重庆市城口": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      108.664214,
      31.947633
    ]
  },
  "重庆市秀山": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      109.007094,
      28.447997
    ]
  },
  "上海市浦东区": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.544379,
      31.221517
    ]
  },
  "上海市松江区": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.227747,
      31.032243
    ]
  },
  "上海市杨浦区": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.526077,
      31.259541
    ]
  },
  "上海市金山区": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.34197,
      30.741991
    ]
  },
  "北京市海淀区": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.329519,
      39.972134
    ]
  },
  "北京市朝阳区": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.601144,
      39.948574
    ]
  },
  "北京市大兴区": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.341014,
      39.784747
    ]
  },
  "北京市西城区": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.365868,
      39.912289
    ]
  },
  "北京市昌平区": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.231204,
      40.22066
    ]
  },
  "北京市通州区": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.656435,
      39.909946
    ]
  },
  "北京市丰台区": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.287149,
      39.858427
    ]
  },
  "北京市东城区": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.416357,
      39.928353
    ]
  },
  "北京市石景山区": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.222982,
      39.906611
    ]
  },
  "北京市顺义区": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.654561,
      40.130347
    ]
  },
  "北京市门头沟区": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.102009,
      39.940646
    ]
  },
  "北京市怀柔区": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.642349,
      40.315704
    ]
  },
  "海南省琼海": {
    "province": "海南省",
    "city": null,
    "location": [
      110.474581,
      19.25914
    ]
  },
  "海南省陵水": {
    "province": "海南省",
    "city": null,
    "location": [
      110.037504,
      18.506048
    ]
  },
  "海南省澄迈": {
    "province": "海南省",
    "city": null,
    "location": [
      110.006755,
      19.738521
    ]
  },
  "海南省临高": {
    "province": "海南省",
    "city": null,
    "location": [
      109.690508,
      19.912026
    ]
  },
  "海南省东方": {
    "province": "海南省",
    "city": null,
    "location": [
      108.651815,
      19.095351
    ]
  },
  "海南省琼中": {
    "province": "海南省",
    "city": null,
    "location": [
      109.838389,
      19.033369
    ]
  },
  "武汉华南海鲜市场": {
    "province": "湖北省",
    "city": "武汉市",
    "location": [
      114.305392,
      30.593098
    ]
  },
  "武汉": {
    "province": "湖北省",
    "city": "武汉市",
    "location": [
      114.305392,
      30.593098
    ]
  },
  "湖北黄冈": {
    "province": "湖北省",
    "city": "黄冈市",
    "location": [
      114.872316,
      30.453905
    ]
  },
  "湖北荆州": {
    "province": "湖北省",
    "city": "荆州市",
    "location": [
      112.239741,
      30.335165
    ]
  },
  "湖北襄阳襄城": {
    "province": "湖北省",
    "city": "襄阳市",
    "location": [
      112.133974,
      32.010351
    ]
  },
  "湖北襄阳樊城": {
    "province": "湖北省",
    "city": "襄阳市",
    "location": [
      112.135684,
      32.044833
    ]
  },
  "湖北襄阳枣阳": {
    "province": "湖北省",
    "city": "襄阳市",
    "location": [
      112.771959,
      32.128818
    ]
  },
  "湖北襄阳南漳": {
    "province": "湖北省",
    "city": "襄阳市",
    "location": [
      111.838905,
      31.774636
    ]
  },
  "湖北孝感": {
    "province": "湖北省",
    "city": "孝感市",
    "location": [
      113.916902,
      30.924568
    ]
  },
  "湖北仙桃": {
    "province": "湖北省",
    "city": null,
    "location": [
      113.442973,
      30.328407
    ]
  },
  "湖北": {
    "province": "湖北省",
    "city": null,
    "location": [
      114.305392,
      30.593098
    ]
  },
  "北京西城区": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.365868,
      39.912289
    ]
  },
  "北京海淀": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.329519,
      39.972134
    ]
  },
  "北京丰台": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.287149,
      39.858427
    ]
  },
  "北京通州": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.656435,
      39.909946
    ]
  },
  "北京大兴": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.341014,
      39.784747
    ]
  },
  "北京昌平": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.231204,
      40.22066
    ]
  },
  "北京朝阳区": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.601144,
      39.948574
    ]
  },
  "北京石景山": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.222982,
      39.906611
    ]
  },
  "北京": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.407526,
      39.90403
    ]
  },
  "北京朝阳": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.601144,
      39.948574
    ]
  },
  "北京顺义": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.654561,
      40.130347
    ]
  },
  "广东深圳": {
    "province": "广东省",
    "city": "深圳市",
    "location": [
      114.057868,
      22.543099
    ]
  },
  "广东珠海": {
    "province": "广东省",
    "city": "珠海市",
    "location": [
      113.576726,
      22.270715
    ]
  },
  "广东惠州": {
    "province": "广东省",
    "city": "惠州市",
    "location": [
      114.416196,
      23.111847
    ]
  },
  "广东湛江": {
    "province": "广东省",
    "city": "湛江市",
    "location": [
      110.359377,
      21.270707
    ]
  },
  "广东广州": {
    "province": "广东省",
    "city": "广州市",
    "location": [
      113.264434,
      23.129162
    ]
  },
  "广东佛山": {
    "province": "广东省",
    "city": "佛山市",
    "location": [
      113.121416,
      23.021548
    ]
  },
  "广东韶关": {
    "province": "广东省",
    "city": "韶关市",
    "location": [
      113.597522,
      24.810403
    ]
  },
  "广东中山": {
    "province": "广东省",
    "city": "中山市",
    "location": [
      113.392782,
      22.517645
    ]
  },
  "广东肇庆": {
    "province": "广东省",
    "city": "肇庆市",
    "location": [
      112.465091,
      23.047191
    ]
  },
  "广东阳江": {
    "province": "广东省",
    "city": "阳江市",
    "location": [
      111.982232,
      21.857958
    ]
  },
  "广东清远": {
    "province": "广东省",
    "city": "清远市",
    "location": [
      113.056031,
      23.681763
    ]
  },
  "上海": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.473701,
      31.230416
    ]
  },
  "浙江杭州": {
    "province": "浙江省",
    "city": "杭州市",
    "location": [
      120.15507,
      30.274084
    ]
  },
  "浙江宁波": {
    "province": "浙江省",
    "city": "宁波市",
    "location": [
      121.550357,
      29.874556
    ]
  },
  "浙江温州": {
    "province": "浙江省",
    "city": "温州市",
    "location": [
      120.699366,
      27.994267
    ]
  },
  "浙江舟山": {
    "province": "浙江省",
    "city": "舟山市",
    "location": [
      122.207215,
      29.985295
    ]
  },
  "浙江台州": {
    "province": "浙江省",
    "city": "台州市",
    "location": [
      121.420757,
      28.656386
    ]
  },
  "浙江绍兴": {
    "province": "浙江省",
    "city": "绍兴市",
    "location": [
      120.580232,
      30.029752
    ]
  },
  "浙江金华": {
    "province": "浙江省",
    "city": "金华市",
    "location": [
      119.647444,
      29.079059
    ]
  },
  "浙江衢州": {
    "province": "浙江省",
    "city": "衢州市",
    "location": [
      118.859457,
      28.970079
    ]
  },
  "浙江嘉兴": {
    "province": "浙江省",
    "city": "嘉兴市",
    "location": [
      120.755486,
      30.746129
    ]
  },
  "云南省第三医院": {
    "province": "云南省",
    "city": "昆明市",
    "location": [
      102.719664,
      25.028048
    ]
  },
  "云南昆明": {
    "province": "云南省",
    "city": "昆明市",
    "location": [
      102.832891,
      24.880095
    ]
  },
  "福建福州连江县医院": {
    "province": "福建省",
    "city": "福州市",
    "location": [
      119.535828,
      26.194025
    ]
  },
  "福建厦门": {
    "province": "福建省",
    "city": "厦门市",
    "location": [
      118.089425,
      24.479833
    ]
  },
  "福建泉州": {
    "province": "福建省",
    "city": "泉州市",
    "location": [
      118.675675,
      24.874132
    ]
  },
  "福建宁德": {
    "province": "福建省",
    "city": "宁德市",
    "location": [
      119.547932,
      26.665617
    ]
  },
  "福建福州": {
    "province": "福建省",
    "city": "福州市",
    "location": [
      119.296494,
      26.074507
    ]
  },
  "四川成都": {
    "province": "四川省",
    "city": "成都市",
    "location": [
      104.066541,
      30.572269
    ]
  },
  "四川绵阳": {
    "province": "四川省",
    "city": "绵阳市",
    "location": [
      104.679114,
      31.46745
    ]
  },
  "四川广安": {
    "province": "四川省",
    "city": "广安市",
    "location": [
      106.633212,
      30.455961
    ]
  },
  "四川达州": {
    "province": "四川省",
    "city": "达州市",
    "location": [
      107.468023,
      31.209571
    ]
  },
  "四川德阳": {
    "province": "四川省",
    "city": "德阳市",
    "location": [
      104.397894,
      31.126855
    ]
  },
  "四川雅安": {
    "province": "四川省",
    "city": "雅安市",
    "location": [
      103.013261,
      29.980537
    ]
  },
  "山东青岛": {
    "province": "山东省",
    "city": "青岛市",
    "location": [
      120.382639,
      36.067082
    ]
  },
  "山东威海乳山": {
    "province": "山东省",
    "city": "威海市",
    "location": [
      121.539765,
      36.919816
    ]
  },
  "山东临沂": {
    "province": "山东省",
    "city": "临沂市",
    "location": [
      118.356448,
      35.104672
    ]
  },
  "山东潍坊": {
    "province": "山东省",
    "city": "潍坊市",
    "location": [
      119.161755,
      36.706774
    ]
  },
  "山东日照": {
    "province": "山东省",
    "city": "日照市",
    "location": [
      119.526888,
      35.416377
    ]
  },
  "山东威海": {
    "province": "山东省",
    "city": "威海市",
    "location": [
      122.120419,
      37.513068
    ]
  },
  "山东济南": {
    "province": "山东省",
    "city": "济南市",
    "location": [
      117.119999,
      36.651216
    ]
  },
  "山东烟台": {
    "province": "山东省",
    "city": "烟台市",
    "location": [
      121.447935,
      37.463822
    ]
  },
  "山东济宁": {
    "province": "山东省",
    "city": "济宁市",
    "location": [
      116.587098,
      35.414921
    ]
  },
  "广西北海": {
    "province": "广西壮族自治区",
    "city": "北海市",
    "location": [
      109.119927,
      21.481254
    ]
  },
  "广西梧州": {
    "province": "广西壮族自治区",
    "city": "梧州市",
    "location": [
      111.279115,
      23.476962
    ]
  },
  "广西柳州": {
    "province": "广西壮族自治区",
    "city": "柳州市",
    "location": [
      109.415953,
      24.325502
    ]
  },
  "广西桂林": {
    "province": "广西壮族自治区",
    "city": "桂林市",
    "location": [
      110.290194,
      25.273566
    ]
  },
  "广西百色": {
    "province": "广西壮族自治区",
    "city": "百色市",
    "location": [
      106.618201,
      23.902333
    ]
  },
  "广西河池": {
    "province": "广西壮族自治区",
    "city": "河池市",
    "location": [
      108.085261,
      24.692931
    ]
  },
  "贵州贵阳": {
    "province": "贵州省",
    "city": "贵阳市",
    "location": [
      106.630153,
      26.647661
    ]
  },
  "贵州铜仁市碧江区": {
    "province": "贵州省",
    "city": "铜仁市",
    "location": [
      109.181122,
      27.690653
    ]
  },
  "贵州黔南州贵定县": {
    "province": "贵州省",
    "city": "黔南布依族苗族自治州",
    "location": [
      107.232889,
      26.557071
    ]
  },
  "安徽合肥": {
    "province": "安徽省",
    "city": "合肥市",
    "location": [
      117.227239,
      31.820586
    ]
  },
  "安徽六安": {
    "province": "安徽省",
    "city": "六安市",
    "location": [
      116.521854,
      31.733699
    ]
  },
  "安徽滁州": {
    "province": "安徽省",
    "city": "滁州市",
    "location": [
      118.317106,
      32.301556
    ]
  },
  "安徽阜阳": {
    "province": "安徽省",
    "city": "阜阳市",
    "location": [
      115.814204,
      32.890124
    ]
  },
  "安徽亳州": {
    "province": "安徽省",
    "city": "亳州市",
    "location": [
      115.778676,
      33.844582
    ]
  },
  "安徽安庆": {
    "province": "安徽省",
    "city": "安庆市",
    "location": [
      117.063754,
      30.543494
    ]
  },
  "安徽池州": {
    "province": "安徽省",
    "city": "池州市",
    "location": [
      117.491568,
      30.6648
    ]
  },
  "安徽蚌埠": {
    "province": "安徽省",
    "city": "蚌埠市",
    "location": [
      117.389719,
      32.916287
    ]
  },
  "海南三亚": {
    "province": "海南省",
    "city": "三亚市",
    "location": [
      109.511909,
      18.252847
    ]
  },
  "海南海口": {
    "province": "海南省",
    "city": "海口市",
    "location": [
      110.198293,
      20.044001
    ]
  },
  "海南万宁": {
    "province": "海南省",
    "city": null,
    "location": [
      110.391073,
      18.795143
    ]
  },
  "海南临高": {
    "province": "海南省",
    "city": null,
    "location": [
      109.690508,
      19.912026
    ]
  },
  "海南海口市龙华区": {
    "province": "海南省",
    "city": "海口市",
    "location": [
      110.328492,
      20.031007
    ]
  },
  "海南儋州市": {
    "province": "海南省",
    "city": "儋州市",
    "location": [
      109.580811,
      19.521134
    ]
  },
  "海南文昌市": {
    "province": "海南省",
    "city": null,
    "location": [
      110.797717,
      19.543422
    ]
  },
  "海南东方市": {
    "province": "海南省",
    "city": null,
    "location": [
      108.651815,
      19.095351
    ]
  },
  "海南五指山市": {
    "province": "海南省",
    "city": null,
    "location": [
      109.516925,
      18.775146
    ]
  },
  "海南临高县": {
    "province": "海南省",
    "city": null,
    "location": [
      109.690508,
      19.912026
    ]
  },
  "海南昌江县": {
    "province": "海南省",
    "city": null,
    "location": [
      109.055724,
      19.298062
    ]
  },
  "海南琼中县": {
    "province": "海南省",
    "city": null,
    "location": [
      109.838389,
      19.033369
    ]
  },
  "宁夏银川": {
    "province": "宁夏回族自治区",
    "city": "银川市",
    "location": [
      106.230909,
      38.487193
    ]
  },
  "宁夏中卫": {
    "province": "宁夏回族自治区",
    "city": "中卫市",
    "location": [
      105.196902,
      37.499972
    ]
  },
  "吉林长春": {
    "province": "吉林省",
    "city": "长春市",
    "location": [
      125.323544,
      43.817071
    ]
  },
  "吉林松原": {
    "province": "吉林省",
    "city": "松原市",
    "location": [
      124.825117,
      45.141789
    ]
  },
  "吉林吉林": {
    "province": "吉林省",
    "city": "吉林市",
    "location": [
      126.549576,
      43.837883
    ]
  },
  "江西抚州东乡": {
    "province": "江西省",
    "city": "抚州市",
    "location": [
      116.358181,
      27.949217
    ]
  },
  "江西萍乡湘东": {
    "province": "江西省",
    "city": "萍乡市",
    "location": [
      113.733047,
      27.640075
    ]
  },
  "江西南昌": {
    "province": "江西省",
    "city": "南昌市",
    "location": [
      115.858197,
      28.682892
    ]
  },
  "江西九江": {
    "province": "江西省",
    "city": "九江市",
    "location": [
      116.00193,
      29.705077
    ]
  },
  "江西新余": {
    "province": "江西省",
    "city": "新余市",
    "location": [
      114.917346,
      27.817808
    ]
  },
  "江西吉安": {
    "province": "江西省",
    "city": "吉安市",
    "location": [
      114.992509,
      27.113443
    ]
  },
  "天津": {
    "province": "天津市",
    "city": "天津市",
    "location": [
      117.200983,
      39.084158
    ]
  },
  "河南原阳县": {
    "province": "河南省",
    "city": "新乡市",
    "location": [
      113.940115,
      35.065587
    ]
  },
  "河南周口": {
    "province": "河南省",
    "city": "周口市",
    "location": [
      114.696951,
      33.626149
    ]
  },
  "河南三门峡市": {
    "province": "河南省",
    "city": "三门峡市",
    "location": [
      111.200135,
      34.772493
    ]
  },
  "河南洛阳": {
    "province": "河南省",
    "city": "洛阳市",
    "location": [
      112.45404,
      34.619682
    ]
  },
  "河南巩义": {
    "province": "河南省",
    "city": "郑州市",
    "location": [
      113.022497,
      34.747834
    ]
  },
  "重庆万州": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      108.408661,
      30.807667
    ]
  },
  "重庆巫山": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      109.879153,
      31.074834
    ]
  },
  "重庆长寿": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      107.081283,
      29.857996
    ]
  },
  "重庆垫江": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      107.33339,
      30.327717
    ]
  },
  "重庆大渡口": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      106.482347,
      29.484527
    ]
  },
  "重庆永川": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      105.927376,
      29.356117
    ]
  },
  "重庆秀山": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      109.007094,
      28.447997
    ]
  },
  "重庆涪陵": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      107.389298,
      29.703113
    ]
  },
  "重庆九龙坡": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      106.53192,
      29.51419
    ]
  },
  "重庆渝北": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      106.631187,
      29.718143
    ]
  },
  "重庆开州区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      108.393143,
      31.1607
    ]
  },
  "重庆忠县": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      108.039002,
      30.29956
    ]
  },
  "重庆云阳县": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      108.697324,
      30.930613
    ]
  },
  "重庆奉节县": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      109.463987,
      31.018498
    ]
  },
  "重庆巫溪县": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      109.570062,
      31.398604
    ]
  },
  "重庆两江新区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      106.5626,
      29.6674
    ]
  },
  "山西白求恩医院": {
    "province": "山西省",
    "city": "太原市",
    "location": [
      112.554205,
      37.776217
    ]
  },
  "湖南长沙": {
    "province": "湖南省",
    "city": "长沙市",
    "location": [
      112.938814,
      28.228209
    ]
  },
  "湖南怀化鹤城区": {
    "province": "湖南省",
    "city": "怀化市",
    "location": [
      110.040315,
      27.578926
    ]
  },
  "湖南长沙浏阳市": {
    "province": "湖南省",
    "city": "长沙市",
    "location": [
      113.643076,
      28.162833
    ]
  },
  "湖南永州": {
    "province": "湖南省",
    "city": "永州市",
    "location": [
      111.613445,
      26.420394
    ]
  },
  "湖南长沙长沙县": {
    "province": "湖南省",
    "city": "长沙市",
    "location": [
      113.08081,
      28.24615
    ]
  },
  "湖南长沙雨花区": {
    "province": "湖南省",
    "city": "长沙市",
    "location": [
      113.038017,
      28.13771
    ]
  },
  "湖南郴州市宜章县": {
    "province": "湖南省",
    "city": "郴州市",
    "location": [
      112.948811,
      25.400222
    ]
  },
  "湖南株洲": {
    "province": "湖南省",
    "city": "株洲市",
    "location": [
      113.134002,
      27.82755
    ]
  },
  "湖南湘潭": {
    "province": "湖南省",
    "city": "湘潭市",
    "location": [
      112.944049,
      27.829738
    ]
  },
  "湖南岳阳": {
    "province": "湖南省",
    "city": "岳阳市",
    "location": [
      113.128958,
      29.357104
    ]
  },
  "湖南娄底": {
    "province": "湖南省",
    "city": "娄底市",
    "location": [
      111.993497,
      27.700062
    ]
  },
  "辽宁大连": {
    "province": "辽宁省",
    "city": "大连市",
    "location": [
      121.614682,
      38.914003
    ]
  },
  "辽宁抚顺": {
    "province": "辽宁省",
    "city": "抚顺市",
    "location": [
      123.957208,
      41.880872
    ]
  },
  "辽宁沈阳": {
    "province": "辽宁省",
    "city": "沈阳市",
    "location": [
      123.431474,
      41.805698
    ]
  },
  "辽宁朝阳凌源市": {
    "province": "辽宁省",
    "city": "朝阳市",
    "location": [
      119.401574,
      41.245445
    ]
  },
  "黑龙江牡丹江": {
    "province": "黑龙江省",
    "city": "牡丹江市",
    "location": [
      129.633168,
      44.551653
    ]
  },
  "黑龙江哈尔滨医科大学附属第一医院": {
    "province": "黑龙江省",
    "city": "哈尔滨市",
    "location": [
      126.647534,
      45.766565
    ]
  },
  "黑龙江绥化市": {
    "province": "黑龙江省",
    "city": "绥化市",
    "location": [
      126.968887,
      46.653845
    ]
  },
  "黑龙江大庆市": {
    "province": "黑龙江省",
    "city": "大庆市",
    "location": [
      125.103784,
      46.589309
    ]
  },
  "河北石家庄": {
    "province": "河北省",
    "city": "石家庄市",
    "location": [
      114.514859,
      38.042306
    ]
  },
  "江苏苏州": {
    "province": "江苏省",
    "city": "苏州市",
    "location": [
      120.585315,
      31.298886
    ]
  },
  "江苏南京": {
    "province": "江苏省",
    "city": "南京市",
    "location": [
      118.796877,
      32.060255
    ]
  },
  "江苏连云港": {
    "province": "江苏省",
    "city": "连云港市",
    "location": [
      119.221611,
      34.596653
    ]
  },
  "江苏扬州": {
    "province": "江苏省",
    "city": "扬州市",
    "location": [
      119.412966,
      32.39421
    ]
  },
  "江苏无锡": {
    "province": "江苏省",
    "city": "无锡市",
    "location": [
      120.31191,
      31.491169
    ]
  },
  "江苏南通": {
    "province": "江苏省",
    "city": "南通市",
    "location": [
      120.894291,
      31.980171
    ]
  },
  "内蒙古满洲里人民医院": {
    "province": "内蒙古自治区",
    "city": "呼伦贝尔市",
    "location": [
      117.37853,
      49.597841
    ]
  },
  "甘肃兰州肺科医院": {
    "province": "甘肃省",
    "city": "兰州市",
    "location": [
      103.796565,
      36.071779
    ]
  },
  "甘肃白银会宁县": {
    "province": "甘肃省",
    "city": "白银市",
    "location": [
      105.053358,
      35.692823
    ]
  },
  "陕西西安": {
    "province": "陕西省",
    "city": "西安市",
    "location": [
      108.940174,
      34.341568
    ]
  },
  "陕西省中医药大学附属医院": {
    "province": "陕西省",
    "city": "西安市",
    "location": [
      108.895372,
      34.264028
    ]
  },
  "陕西": {
    "province": "陕西省",
    "city": null,
    "location": [
      108.954239,
      34.265472
    ]
  },
  "新疆乌鲁木齐": {
    "province": "新疆维吾尔自治区",
    "city": "乌鲁木齐市",
    "location": [
      87.616848,
      43.825592
    ]
  },
  "新疆维吾尔自治区胡杨河": {
    "province": "新疆维吾尔自治区",
    "city": null,
    "location": [
      87.627704,
      43.793026
    ]
  },
  "新疆维吾尔自治区石河子": {
    "province": "新疆维吾尔自治区",
    "city": null,
    "location": [
      86.08046,
      44.305428
    ]
  },
  "湖北省恩施": {
    "province": "湖北省",
    "city": "恩施土家族苗族自治州",
    "location": [
      109.488172,
      30.272156
    ]
  },
  "辽宁省鞍山": {
    "province": "辽宁省",
    "city": "鞍山市",
    "location": [
      122.994329,
      41.108647
    ]
  },
  "辽宁省阜新": {
    "province": "辽宁省",
    "city": "阜新市",
    "location": [
      121.670323,
      42.021619
    ]
  },
  "山西省晋城": {
    "province": "山西省",
    "city": "晋城市",
    "location": [
      112.851831,
      35.490701
    ]
  },
  "山西省忻州": {
    "province": "山西省",
    "city": "忻州市",
    "location": [
      112.734174,
      38.416663
    ]
  },
  "重庆市沙坪坝区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      106.456878,
      29.541145
    ]
  },
  "上海市普陀区": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.395555,
      31.24984
    ]
  },
  "上海市未知地区": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.473701,
      31.230416
    ]
  },
  "河北省秦皇岛": {
    "province": "河北省",
    "city": "秦皇岛市",
    "location": [
      119.600492,
      39.935385
    ]
  },
  "江苏省待明确": {
    "province": "江苏省",
    "city": null,
    "location": [
      118.763232,
      32.061707
    ]
  },
  "广东省潮州": {
    "province": "广东省",
    "city": "潮州市",
    "location": [
      116.622603,
      23.65695
    ]
  },
  "天津市宝坻区": {
    "province": "天津市",
    "city": "天津市",
    "location": [
      117.309863,
      39.717379
    ]
  },
  "新疆维吾尔自治区第八师": {
    "province": "新疆维吾尔自治区",
    "city": null,
    "location": [
      87.627704,
      43.793026
    ]
  },
  "新疆维吾尔自治区第九师": {
    "province": "新疆维吾尔自治区",
    "city": null,
    "location": [
      87.627704,
      43.793026
    ]
  },
  "青海省西宁市": {
    "province": "青海省",
    "city": "西宁市",
    "location": [
      101.778228,
      36.617144
    ]
  },
  "云南省临沧": {
    "province": "云南省",
    "city": "临沧市",
    "location": [
      100.079583,
      23.877573
    ]
  },
  "北京市房山区": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.143267,
      39.749144
    ]
  },
  "天津市东丽区": {
    "province": "天津市",
    "city": "天津市",
    "location": [
      117.314324,
      39.086569
    ]
  },
  "甘肃省甘南": {
    "province": "甘肃省",
    "city": "甘南藏族自治州",
    "location": [
      102.911027,
      34.983385
    ]
  },
  "待明确地区": {
    "invalid": true,
    "location": []
  },
  "上海市崇明区": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.397417,
      31.623587
    ]
  },
  "广西壮族自治区贵港": {
    "province": "广西壮族自治区",
    "city": "贵港市",
    "location": [
      109.598926,
      23.11153
    ]
  },
  "河南省邓州": {
    "province": "河南省",
    "city": "南阳市",
    "location": [
      112.087278,
      32.687938
    ]
  },
  "山东省未知地区": {
    "province": "山东省",
    "city": null,
    "location": [
      117.020359,
      36.66853
    ]
  },
  "贵州省安顺": {
    "province": "贵州省",
    "city": "安顺市",
    "location": [
      105.947593,
      26.253072
    ]
  },
  "黑龙江省黑河": {
    "province": "黑龙江省",
    "city": "黑河市",
    "location": [
      127.52856,
      50.245329
    ]
  },
  "黑龙江省未明确": {
    "province": "黑龙江省",
    "city": null,
    "location": [
      126.661669,
      45.742347
    ]
  },
  "内蒙古自治区乌海": {
    "province": "内蒙古自治区",
    "city": "乌海市",
    "location": [
      106.794249,
      39.655388
    ]
  },
  "北京市待明确地区": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.407526,
      39.90403
    ]
  },
  "青海省待明确地区": {
    "province": "青海省",
    "city": null,
    "location": [
      101.780199,
      36.620901
    ]
  },
  "西藏自治区待明确地区": {
    "province": "西藏自治区",
    "city": null,
    "location": [
      91.117212,
      29.646922
    ]
  },
  "云南省楚雄": {
    "province": "云南省",
    "city": "楚雄彝族自治州",
    "location": [
      101.528069,
      25.045532
    ]
  },
  "重庆市高新区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      106.551556,
      29.563009
    ]
  },
  "甘肃省庆阳": {
    "province": "甘肃省",
    "city": "庆阳市",
    "location": [
      107.643631,
      35.709077
    ]
  },
  "海南省文昌": {
    "province": "海南省",
    "city": null,
    "location": [
      110.797717,
      19.543422
    ]
  },
  "河南省济源": {
    "province": "河南省",
    "city": null,
    "location": [
      112.602344,
      35.06903
    ]
  },
  "内蒙古自治区乌海市": {
    "province": "内蒙古自治区",
    "city": "乌海市",
    "location": [
      106.794249,
      39.655388
    ]
  },
  "青海省北海州": {
    "province": "青海省",
    "city": null,
    "location": [
      101.780199,
      36.620901
    ]
  },
  "青海省海北州": {
    "province": "青海省",
    "city": "海北藏族自治州",
    "location": [
      100.900997,
      36.954413
    ]
  },
  "北京市延庆区": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      115.974848,
      40.456951
    ]
  },
  "云南省待明确地区": {
    "province": "云南省",
    "city": null,
    "location": [
      102.710002,
      25.045806
    ]
  },
  "云南省文山": {
    "province": "云南省",
    "city": "文山壮族苗族自治州",
    "location": [
      104.216248,
      23.400733
    ]
  },
  "重庆市彭水县": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      108.165538,
      29.293902
    ]
  },
  "吉林省辽源": {
    "province": "吉林省",
    "city": "辽源市",
    "location": [
      125.143532,
      42.887918
    ]
  },
  "新疆维吾尔自治区昌吉": {
    "province": "新疆维吾尔自治区",
    "city": "昌吉回族自治州",
    "location": [
      87.308224,
      44.011182
    ]
  },
  "新疆维吾尔自治区第六师": {
    "province": "新疆维吾尔自治区",
    "city": "乌鲁木齐市",
    "location": [
      87.650294,
      43.94487
    ]
  },
  "陕西省杨凌": {
    "province": "陕西省",
    "city": null,
    "location": [
      108.954239,
      34.265472
    ]
  },
  "宁夏回族自治区石嘴山": {
    "province": "宁夏回族自治区",
    "city": "石嘴山市",
    "location": [
      106.383303,
      38.983236
    ]
  },
  "吉林省吉林市": {
    "province": "吉林省",
    "city": "吉林市",
    "location": [
      126.549576,
      43.837883
    ]
  },
  "西藏自治区拉萨": {
    "province": "西藏自治区",
    "city": "拉萨市",
    "location": [
      91.140856,
      29.645554
    ]
  }
};