window.LocDoc={
  "湖北省武汉": {
    "province": "湖北省",
    "city": "武汉市",
    "location": [
      114.305392,
      30.593098
    ]
  },
  "湖北省孝感": {
    "province": "湖北省",
    "city": "孝感市",
    "location": [
      113.916902,
      30.924568
    ]
  },
  "湖北省黄冈": {
    "province": "湖北省",
    "city": "黄冈市",
    "location": [
      114.872316,
      30.453905
    ]
  },
  "湖北省荆州": {
    "province": "湖北省",
    "city": "荆州市",
    "location": [
      112.239741,
      30.335165
    ]
  },
  "湖北省荆门": {
    "province": "湖北省",
    "city": "荆门市",
    "location": [
      112.199265,
      31.035423
    ]
  },
  "湖北省仙桃": {
    "province": "湖北省",
    "city": null,
    "location": [
      113.442973,
      30.328407
    ]
  },
  "湖北省宜昌": {
    "province": "湖北省",
    "city": "宜昌市",
    "location": [
      111.286471,
      30.691967
    ]
  },
  "湖北省十堰": {
    "province": "湖北省",
    "city": "十堰市",
    "location": [
      110.79799,
      32.629397
    ]
  },
  "广东省深圳": {
    "province": "广东省",
    "city": "深圳市",
    "location": [
      114.057868,
      22.543099
    ]
  },
  "广东省珠海": {
    "province": "广东省",
    "city": "珠海市",
    "location": [
      113.576726,
      22.270715
    ]
  },
  "广东省佛山": {
    "province": "广东省",
    "city": "佛山市",
    "location": [
      113.121416,
      23.021548
    ]
  },
  "广东省广州": {
    "province": "广东省",
    "city": "广州市",
    "location": [
      113.264434,
      23.129162
    ]
  },
  "广东省惠州": {
    "province": "广东省",
    "city": "惠州市",
    "location": [
      114.416196,
      23.111847
    ]
  },
  "广东省韶关": {
    "province": "广东省",
    "city": "韶关市",
    "location": [
      113.597522,
      24.810403
    ]
  },
  "广东省阳江": {
    "province": "广东省",
    "city": "阳江市",
    "location": [
      111.982232,
      21.857958
    ]
  },
  "广东省湛江": {
    "province": "广东省",
    "city": "湛江市",
    "location": [
      110.359377,
      21.270707
    ]
  },
  "广东省中山": {
    "province": "广东省",
    "city": "中山市",
    "location": [
      113.392782,
      22.517645
    ]
  },
  "广东省肇庆": {
    "province": "广东省",
    "city": "肇庆市",
    "location": [
      112.465091,
      23.047191
    ]
  },
  "广东省清远": {
    "province": "广东省",
    "city": "清远市",
    "location": [
      113.056031,
      23.681763
    ]
  },
  "浙江省台州": {
    "province": "浙江省",
    "city": "台州市",
    "location": [
      121.420757,
      28.656386
    ]
  },
  "浙江省杭州": {
    "province": "浙江省",
    "city": "杭州市",
    "location": [
      120.15507,
      30.274084
    ]
  },
  "浙江省温州": {
    "province": "浙江省",
    "city": "温州市",
    "location": [
      120.699366,
      27.994267
    ]
  },
  "浙江省宁波": {
    "province": "浙江省",
    "city": "宁波市",
    "location": [
      121.550357,
      29.874556
    ]
  },
  "浙江省嘉兴": {
    "province": "浙江省",
    "city": "嘉兴市",
    "location": [
      120.755486,
      30.746129
    ]
  },
  "浙江省衢州": {
    "province": "浙江省",
    "city": "衢州市",
    "location": [
      118.859457,
      28.970079
    ]
  },
  "浙江省舟山": {
    "province": "浙江省",
    "city": "舟山市",
    "location": [
      122.207215,
      29.985295
    ]
  },
  "浙江省绍兴": {
    "province": "浙江省",
    "city": "绍兴市",
    "location": [
      120.580232,
      30.029752
    ]
  },
  "浙江省金华": {
    "province": "浙江省",
    "city": "金华市",
    "location": [
      119.647444,
      29.079059
    ]
  },
  "北京市外地来京人员": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.407526,
      39.90403
    ]
  },
  "北京市海淀": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.329519,
      39.972134
    ]
  },
  "北京市朝阳": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.601144,
      39.948574
    ]
  },
  "北京市西城": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.365868,
      39.912289
    ]
  },
  "北京市昌平": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.231204,
      40.22066
    ]
  },
  "北京市大兴": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.341014,
      39.784747
    ]
  },
  "北京市丰台": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.287149,
      39.858427
    ]
  },
  "北京市通州": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.656435,
      39.909946
    ]
  },
  "北京市石景山": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.222982,
      39.906611
    ]
  },
  "北京市顺义": {
    "province": "北京市",
    "city": "北京市",
    "location": [
      116.654561,
      40.130347
    ]
  },
  "重庆市万州区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      108.408661,
      30.807667
    ]
  },
  "重庆市巫山县": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      109.879153,
      31.074834
    ]
  },
  "重庆市长寿区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      107.081283,
      29.857996
    ]
  },
  "重庆市垫江县": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      107.33339,
      30.327717
    ]
  },
  "重庆市永川区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      105.927376,
      29.356117
    ]
  },
  "重庆市九龙坡区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      106.53192,
      29.51419
    ]
  },
  "重庆市渝北区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      106.631187,
      29.718143
    ]
  },
  "重庆市开州区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      108.393143,
      31.1607
    ]
  },
  "重庆市涪陵区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      107.389298,
      29.703113
    ]
  },
  "重庆市大渡口区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      106.482347,
      29.484527
    ]
  },
  "重庆市忠县": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      108.039002,
      30.29956
    ]
  },
  "重庆市云阳县": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      108.697324,
      30.930613
    ]
  },
  "重庆市奉节县": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      109.463987,
      31.018498
    ]
  },
  "重庆市巫溪县": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      109.570062,
      31.398604
    ]
  },
  "重庆市秀山县": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      109.007094,
      28.447997
    ]
  },
  "重庆市两江新区": {
    "province": "重庆市",
    "city": "重庆市",
    "location": [
      106.5626,
      29.6674
    ]
  },
  "湖南省长沙": {
    "province": "湖南省",
    "city": "长沙市",
    "location": [
      112.938814,
      28.228209
    ]
  },
  "湖南省永州": {
    "province": "湖南省",
    "city": "永州市",
    "location": [
      111.613445,
      26.420394
    ]
  },
  "湖南省怀化": {
    "province": "湖南省",
    "city": "怀化市",
    "location": [
      109.998488,
      27.554978
    ]
  },
  "湖南省岳阳": {
    "province": "湖南省",
    "city": "岳阳市",
    "location": [
      113.128958,
      29.357104
    ]
  },
  "湖南省娄底": {
    "province": "湖南省",
    "city": "娄底市",
    "location": [
      111.993497,
      27.700062
    ]
  },
  "湖南省郴州": {
    "province": "湖南省",
    "city": "郴州市",
    "location": [
      113.014717,
      25.770509
    ]
  },
  "湖南省株洲": {
    "province": "湖南省",
    "city": "株洲市",
    "location": [
      113.134002,
      27.82755
    ]
  },
  "湖南省湘潭": {
    "province": "湖南省",
    "city": "湘潭市",
    "location": [
      112.944049,
      27.829738
    ]
  },
  "广西壮族自治区北海": {
    "province": "广西壮族自治区",
    "city": "北海市",
    "location": [
      109.119927,
      21.481254
    ]
  },
  "广西壮族自治区桂林": {
    "province": "广西壮族自治区",
    "city": "桂林市",
    "location": [
      110.290194,
      25.273566
    ]
  },
  "广西壮族自治区柳州": {
    "province": "广西壮族自治区",
    "city": "柳州市",
    "location": [
      109.415953,
      24.325502
    ]
  },
  "广西壮族自治区河池": {
    "province": "广西壮族自治区",
    "city": "河池市",
    "location": [
      108.085261,
      24.692931
    ]
  },
  "广西壮族自治区防城港": {
    "province": "广西壮族自治区",
    "city": "防城港市",
    "location": [
      108.353846,
      21.68686
    ]
  },
  "广西壮族自治区梧州": {
    "province": "广西壮族自治区",
    "city": "梧州市",
    "location": [
      111.279115,
      23.476962
    ]
  },
  "广西壮族自治区百色": {
    "province": "广西壮族自治区",
    "city": "百色市",
    "location": [
      106.618201,
      23.902333
    ]
  },
  "广西壮族自治区玉林": {
    "province": "广西壮族自治区",
    "city": "玉林市",
    "location": [
      110.164756,
      22.636379
    ]
  },
  "上海市": {
    "province": "上海市",
    "city": "上海市",
    "location": [
      121.473701,
      31.230416
    ]
  },
  "江西省南昌": {
    "province": "江西省",
    "city": "南昌市",
    "location": [
      115.858197,
      28.682892
    ]
  },
  "江西省抚州": {
    "province": "江西省",
    "city": "抚州市",
    "location": [
      116.358181,
      27.949217
    ]
  },
  "江西省萍乡": {
    "province": "江西省",
    "city": "萍乡市",
    "location": [
      113.854556,
      27.622768
    ]
  },
  "江西省九江": {
    "province": "江西省",
    "city": "九江市",
    "location": [
      116.00193,
      29.705077
    ]
  },
  "江西省新余": {
    "province": "江西省",
    "city": "新余市",
    "location": [
      114.917346,
      27.817808
    ]
  },
  "江西省吉安": {
    "province": "江西省",
    "city": "吉安市",
    "location": [
      114.992509,
      27.113443
    ]
  },
  "四川省成都": {
    "province": "四川省",
    "city": "成都市",
    "location": [
      104.066541,
      30.572269
    ]
  },
  "四川省广安": {
    "province": "四川省",
    "city": "广安市",
    "location": [
      106.633212,
      30.455961
    ]
  },
  "四川省绵阳": {
    "province": "四川省",
    "city": "绵阳市",
    "location": [
      104.679114,
      31.46745
    ]
  },
  "四川省达州": {
    "province": "四川省",
    "city": "达州市",
    "location": [
      107.468023,
      31.209571
    ]
  },
  "四川省德阳": {
    "province": "四川省",
    "city": "德阳市",
    "location": [
      104.397894,
      31.126855
    ]
  },
  "四川省遂宁": {
    "province": "四川省",
    "city": "遂宁市",
    "location": [
      105.592898,
      30.532847
    ]
  },
  "四川省雅安": {
    "province": "四川省",
    "city": "雅安市",
    "location": [
      103.013261,
      29.980537
    ]
  },
  "山东省青岛": {
    "province": "山东省",
    "city": "青岛市",
    "location": [
      120.382639,
      36.067082
    ]
  },
  "山东省威海": {
    "province": "山东省",
    "city": "威海市",
    "location": [
      122.120419,
      37.513068
    ]
  },
  "山东省临沂": {
    "province": "山东省",
    "city": "临沂市",
    "location": [
      118.356448,
      35.104672
    ]
  },
  "山东省济南": {
    "province": "山东省",
    "city": "济南市",
    "location": [
      117.119999,
      36.651216
    ]
  },
  "山东省烟台": {
    "province": "山东省",
    "city": "烟台市",
    "location": [
      121.447935,
      37.463822
    ]
  },
  "山东省潍坊": {
    "province": "山东省",
    "city": "潍坊市",
    "location": [
      119.161755,
      36.706774
    ]
  },
  "山东省日照": {
    "province": "山东省",
    "city": "日照市",
    "location": [
      119.526888,
      35.416377
    ]
  },
  "山东省济宁": {
    "province": "山东省",
    "city": "济宁市",
    "location": [
      116.587098,
      35.414921
    ]
  },
  "安徽省合肥": {
    "province": "安徽省",
    "city": "合肥市",
    "location": [
      117.227239,
      31.820586
    ]
  },
  "安徽省六安": {
    "province": "安徽省",
    "city": "六安市",
    "location": [
      116.521854,
      31.733699
    ]
  },
  "安徽省阜阳": {
    "province": "安徽省",
    "city": "阜阳市",
    "location": [
      115.814204,
      32.890124
    ]
  },
  "安徽省滁州": {
    "province": "安徽省",
    "city": "滁州市",
    "location": [
      118.317106,
      32.301556
    ]
  },
  "安徽省亳州": {
    "province": "安徽省",
    "city": "亳州市",
    "location": [
      115.778676,
      33.844582
    ]
  },
  "安徽省安庆": {
    "province": "安徽省",
    "city": "安庆市",
    "location": [
      117.063754,
      30.543494
    ]
  },
  "安徽省池州": {
    "province": "安徽省",
    "city": "池州市",
    "location": [
      117.491568,
      30.6648
    ]
  },
  "安徽省蚌埠": {
    "province": "安徽省",
    "city": "蚌埠市",
    "location": [
      117.389719,
      32.916287
    ]
  },
  "福建省福州": {
    "province": "福建省",
    "city": "福州市",
    "location": [
      119.296494,
      26.074507
    ]
  },
  "福建省厦门": {
    "province": "福建省",
    "city": "厦门市",
    "location": [
      118.089425,
      24.479833
    ]
  },
  "福建省泉州": {
    "province": "福建省",
    "city": "泉州市",
    "location": [
      118.675675,
      24.874132
    ]
  },
  "福建省宁德": {
    "province": "福建省",
    "city": "宁德市",
    "location": [
      119.547932,
      26.665617
    ]
  },
  "河南省郑州": {
    "province": "河南省",
    "city": "郑州市",
    "location": [
      113.625368,
      34.746599
    ]
  },
  "河南省巩义": {
    "province": "河南省",
    "city": "郑州市",
    "location": [
      113.022497,
      34.747834
    ]
  },
  "河南省洛阳": {
    "province": "河南省",
    "city": "洛阳市",
    "location": [
      112.45404,
      34.619682
    ]
  },
  "河南省三门峡": {
    "province": "河南省",
    "city": "三门峡市",
    "location": [
      111.200135,
      34.772493
    ]
  },
  "河南省信阳": {
    "province": "河南省",
    "city": "信阳市",
    "location": [
      114.091023,
      32.146983
    ]
  },
  "河南省周口": {
    "province": "河南省",
    "city": "周口市",
    "location": [
      114.696951,
      33.626149
    ]
  },
  "江苏省南京": {
    "province": "江苏省",
    "city": "南京市",
    "location": [
      118.796877,
      32.060255
    ]
  },
  "江苏省苏州": {
    "province": "江苏省",
    "city": "苏州市",
    "location": [
      120.585315,
      31.298886
    ]
  },
  "江苏省连云港": {
    "province": "江苏省",
    "city": "连云港市",
    "location": [
      119.221611,
      34.596653
    ]
  },
  "江苏省扬州": {
    "province": "江苏省",
    "city": "扬州市",
    "location": [
      119.412966,
      32.39421
    ]
  },
  "江苏省南通": {
    "province": "江苏省",
    "city": "南通市",
    "location": [
      120.894291,
      31.980171
    ]
  },
  "江苏省无锡": {
    "province": "江苏省",
    "city": "无锡市",
    "location": [
      120.31191,
      31.491169
    ]
  },
  "海南省海口": {
    "province": "海南省",
    "city": "海口市",
    "location": [
      110.198293,
      20.044001
    ]
  },
  "海南省三亚": {
    "province": "海南省",
    "city": "三亚市",
    "location": [
      109.511909,
      18.252847
    ]
  },
  "海南省万宁": {
    "province": "海南省",
    "city": null,
    "location": [
      110.391073,
      18.795143
    ]
  },
  "海南省临高县": {
    "province": "海南省",
    "city": null,
    "location": [
      109.690508,
      19.912026
    ]
  },
  "天津市": {
    "province": "天津市",
    "city": "天津市",
    "location": [
      117.200983,
      39.084158
    ]
  },
  "云南省昆明": {
    "province": "云南省",
    "city": "昆明市",
    "location": [
      102.832891,
      24.880095
    ]
  },
  "云南省西双版纳州": {
    "province": "云南省",
    "city": "西双版纳傣族自治州",
    "location": [
      100.797777,
      22.007351
    ]
  },
  "云南省丽江市": {
    "province": "云南省",
    "city": "丽江市",
    "location": [
      100.22775,
      26.855047
    ]
  },
  "陕西省西安": {
    "province": "陕西省",
    "city": "西安市",
    "location": [
      108.940174,
      34.341568
    ]
  },
  "陕西省咸阳": {
    "province": "陕西省",
    "city": "咸阳市",
    "location": [
      108.708991,
      34.329605
    ]
  },
  "陕西省安康": {
    "province": "陕西省",
    "city": "安康市",
    "location": [
      109.029022,
      32.684714
    ]
  },
  "陕西省延安": {
    "province": "陕西省",
    "city": "延安市",
    "location": [
      109.489727,
      36.585455
    ]
  },
  "黑龙江省牡丹江": {
    "province": "黑龙江省",
    "city": "牡丹江市",
    "location": [
      129.633168,
      44.551653
    ]
  },
  "黑龙江省哈尔滨": {
    "province": "黑龙江省",
    "city": "哈尔滨市",
    "location": [
      126.534967,
      45.803775
    ]
  },
  "黑龙江省大庆": {
    "province": "黑龙江省",
    "city": "大庆市",
    "location": [
      125.103784,
      46.589309
    ]
  },
  "黑龙江省绥化": {
    "province": "黑龙江省",
    "city": "绥化市",
    "location": [
      126.968887,
      46.653845
    ]
  },
  "辽宁省沈阳": {
    "province": "辽宁省",
    "city": "沈阳市",
    "location": [
      123.431474,
      41.805698
    ]
  },
  "辽宁省大连": {
    "province": "辽宁省",
    "city": "大连市",
    "location": [
      121.614682,
      38.914003
    ]
  },
  "辽宁省朝阳": {
    "province": "辽宁省",
    "city": "朝阳市",
    "location": [
      120.389862,
      41.497767
    ]
  },
  "贵州省贵阳": {
    "province": "贵州省",
    "city": "贵阳市",
    "location": [
      106.630153,
      26.647661
    ]
  },
  "贵州省铜仁": {
    "province": "贵州省",
    "city": "铜仁市",
    "location": [
      109.189598,
      27.731514
    ]
  },
  "贵州省黔南州": {
    "province": "贵州省",
    "city": "黔南布依族苗族自治州",
    "location": [
      107.522097,
      26.254092
    ]
  },
  "吉林省长春": {
    "province": "吉林省",
    "city": "长春市",
    "location": [
      125.323544,
      43.817071
    ]
  },
  "吉林省吉林": {
    "province": "吉林省",
    "city": "吉林市",
    "location": [
      126.549576,
      43.837883
    ]
  },
  "吉林省松原": {
    "province": "吉林省",
    "city": "松原市",
    "location": [
      124.825117,
      45.141789
    ]
  },
  "台湾": {
    "province": "台湾省",
    "city": null,
    "location": [
      121.508903,
      25.044319
    ]
  },
  "宁夏回族自治区银川": {
    "province": "宁夏回族自治区",
    "city": "银川市",
    "location": [
      106.230909,
      38.487193
    ]
  },
  "宁夏回族自治区中卫": {
    "province": "宁夏回族自治区",
    "city": "中卫市",
    "location": [
      105.196902,
      37.499972
    ]
  },
  "香港": {
    "province": "香港特别行政区",
    "city": null,
    "location": [
      114.163825,
      22.276284
    ]
  },
  "澳门": {
    "province": "澳门特别行政区",
    "city": null,
    "location": [
      113.543028,
      22.186835
    ]
  },
  "河北省石家庄": {
    "province": "河北省",
    "city": "石家庄市",
    "location": [
      114.514859,
      38.042306
    ]
  },
  "河北省沧州": {
    "province": "河北省",
    "city": "沧州市",
    "location": [
      116.838834,
      38.304477
    ]
  },
  "甘肃省兰州": {
    "province": "甘肃省",
    "city": "兰州市",
    "location": [
      103.834303,
      36.061089
    ]
  },
  "甘肃省白银": {
    "province": "甘肃省",
    "city": "白银市",
    "location": [
      104.138559,
      36.544756
    ]
  },
  "新疆维吾尔自治区": {
    "province": "新疆维吾尔自治区",
    "city": null,
    "location": [
      87.627704,
      43.793026
    ]
  },
  "山西省太原": {
    "province": "山西省",
    "city": "太原市",
    "location": [
      112.548879,
      37.87059
    ]
  },
  "内蒙古自治区满洲里": {
    "province": "内蒙古自治区",
    "city": "呼伦贝尔市",
    "location": [
      117.37853,
      49.597841
    ]
  },
  "青海省": {
    "province": "青海省",
    "city": null,
    "location": [
      101.780199,
      36.620901
    ]
  }
};